# Comparing `tmp/flowtask-4.5.5-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip` & `tmp/flowtask-4.5.6-cp39-cp39-manylinux_2_17_x86_64.manylinux2014_x86_64.whl.zip`

## zipinfo {}

```diff
@@ -1,226 +1,226 @@
-Zip file size: 2329896 bytes, number of entries: 224
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-25 00:49 plugins/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-25 00:49 flowtask.libs/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-25 00:49 flowtask/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-25 00:49 flowtask-4.5.5.dist-info/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-25 00:49 plugins/sources/
-drwxr-xr-x  2.0 unx        0 b- stor 23-Jun-25 00:49 plugins/components/
--rw-r--r--  2.0 unx        0 b- defN 23-Jun-25 00:49 plugins/sources/__init__.py
--rw-r--r--  2.0 unx     9592 b- defN 23-Jun-25 00:49 plugins/sources/venu.py
--rw-r--r--  2.0 unx     8587 b- defN 23-Jun-25 00:49 plugins/sources/uap.py
--rw-r--r--  2.0 unx    11152 b- defN 23-Jun-25 00:49 plugins/sources/vocinity.py
--rw-r--r--  2.0 unx    19826 b- defN 23-Jun-25 00:49 plugins/sources/mobileinsight.py
--rw-r--r--  2.0 unx    23000 b- defN 23-Jun-25 00:49 plugins/sources/hubspot.py
--rw-r--r--  2.0 unx     8167 b- defN 23-Jun-25 00:49 plugins/sources/newrelic.py
--rw-r--r--  2.0 unx     2757 b- defN 23-Jun-25 00:49 plugins/sources/get_populartimes.py
--rw-r--r--  2.0 unx    18326 b- defN 23-Jun-25 00:49 plugins/sources/icims.py

     <99>   DW_AT_type        : (ref4) <0x92>, char
  <1><9d>: Abbrev Number: 2 (DW_TAG_typedef)
-    <9e>   DW_AT_name        : (strp) (offset: 0x1e18): ssize_t
+    <9e>   DW_AT_name        : (strp) (offset: 0x1d66): ssize_t
     <a2>   DW_AT_decl_file   : (data1) 5
     <a3>   DW_AT_decl_line   : (data1) 102
     <a4>   DW_AT_decl_column : (data1) 19
     <a5>   DW_AT_type        : (ref4) <0x79>, __ssize_t, long int
  <1><a9>: Abbrev Number: 8 (DW_TAG_typedef)
-    <aa>   DW_AT_name        : (strp) (offset: 0x265e): wchar_t
+    <aa>   DW_AT_name        : (strp) (offset: 0x2569): wchar_t
     <ae>   DW_AT_decl_file   : (data1) 3
     <af>   DW_AT_decl_line   : (data2) 321
     <b1>   DW_AT_decl_column : (data1) 24
     <b2>   DW_AT_type        : (ref4) <0x5f>, int
  <1><b6>: Abbrev Number: 3 (DW_TAG_base_type)
     <b7>   DW_AT_byte_size   : (data1) 8
     <b8>   DW_AT_encoding    : (data1) 5	(signed)
-    <b9>   DW_AT_name        : (strp) (offset: 0x3ed6): long long int
+    <b9>   DW_AT_name        : (strp) (offset: 0x3e3b): long long int
  <1><bd>: Abbrev Number: 2 (DW_TAG_typedef)
-    <be>   DW_AT_name        : (strp) (offset: 0x2be2): int32_t
+    <be>   DW_AT_name        : (strp) (offset: 0x2b66): int32_t
     <c2>   DW_AT_decl_file   : (data1) 6
     <c3>   DW_AT_decl_line   : (data1) 196
     <c4>   DW_AT_decl_column : (data1) 1
     <c5>   DW_AT_type        : (ref4) <0x5f>, int
  <1><c9>: Abbrev Number: 2 (DW_TAG_typedef)
-    <ca>   DW_AT_name        : (strp) (offset: 0x1254): int64_t
+    <ca>   DW_AT_name        : (strp) (offset: 0x126c): int64_t
     <ce>   DW_AT_decl_file   : (data1) 6
     <cf>   DW_AT_decl_line   : (data1) 197
     <d0>   DW_AT_decl_column : (data1) 1
     <d1>   DW_AT_type        : (ref4) <0x6b>, long int
  <1><d5>: Abbrev Number: 3 (DW_TAG_base_type)
     <d6>   DW_AT_byte_size   : (data1) 8
     <d7>   DW_AT_encoding    : (data1) 7	(unsigned)
-    <d8>   DW_AT_name        : (strp) (offset: 0x3a33): long long unsigned int
+    <d8>   DW_AT_name        : (strp) (offset: 0x3977): long long unsigned int
  <1><dc>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <dd>   DW_AT_byte_size   : (data1) 8
     <de>   DW_AT_type        : (ref4) <0xe2>
  <1><e2>: Abbrev Number: 9 (DW_TAG_const_type)
  <1><e3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <e4>   DW_AT_name        : (strp) (offset: 0x1723): uint8_t
+    <e4>   DW_AT_name        : (strp) (offset: 0x16d7): uint8_t
     <e8>   DW_AT_decl_file   : (data1) 7
     <e9>   DW_AT_decl_line   : (data1) 48
     <ea>   DW_AT_decl_column : (data1) 24
     <eb>   DW_AT_type        : (ref4) <0x3c>, unsigned char
  <1><ef>: Abbrev Number: 2 (DW_TAG_typedef)
-    <f0>   DW_AT_name        : (strp) (offset: 0x3ca): uint16_t
+    <f0>   DW_AT_name        : (strp) (offset: 0x400): uint16_t
     <f4>   DW_AT_decl_file   : (data1) 7
     <f5>   DW_AT_decl_line   : (data1) 49
     <f6>   DW_AT_decl_column : (data1) 28
     <f7>   DW_AT_type        : (ref4) <0x43>, short unsigned int
  <1><fb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <fc>   DW_AT_name        : (strp) (offset: 0x2be1): uint32_t
+    <fc>   DW_AT_name        : (strp) (offset: 0x2b65): uint32_t
     <100>   DW_AT_decl_file   : (data1) 7
     <101>   DW_AT_decl_line   : (data1) 51
     <102>   DW_AT_decl_column : (data1) 23
     <103>   DW_AT_type        : (ref4) <0x4a>, unsigned int
  <1><107>: Abbrev Number: 2 (DW_TAG_typedef)
-    <108>   DW_AT_name        : (strp) (offset: 0x1253): uint64_t
+    <108>   DW_AT_name        : (strp) (offset: 0x126b): uint64_t
     <10c>   DW_AT_decl_file   : (data1) 7
     <10d>   DW_AT_decl_line   : (data1) 55
     <10e>   DW_AT_decl_column : (data1) 27
     <10f>   DW_AT_type        : (ref4) <0x35>, long unsigned int
  <1><113>: Abbrev Number: 2 (DW_TAG_typedef)
-    <114>   DW_AT_name        : (strp) (offset: 0x3e4a): Py_ssize_t
+    <114>   DW_AT_name        : (strp) (offset: 0x3daf): Py_ssize_t
     <118>   DW_AT_decl_file   : (data1) 8
     <119>   DW_AT_decl_line   : (data1) 105
     <11a>   DW_AT_decl_column : (data1) 25
     <11b>   DW_AT_type        : (ref4) <0x9d>, ssize_t, __ssize_t, long int
  <1><11f>: Abbrev Number: 5 (DW_TAG_const_type)
     <120>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><124>: Abbrev Number: 2 (DW_TAG_typedef)
-    <125>   DW_AT_name        : (strp) (offset: 0x1c5c): Py_hash_t
+    <125>   DW_AT_name        : (strp) (offset: 0x1bbf): Py_hash_t
     <129>   DW_AT_decl_file   : (data1) 8
     <12a>   DW_AT_decl_line   : (data1) 114
     <12b>   DW_AT_decl_column : (data1) 20
     <12c>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><130>: Abbrev Number: 3 (DW_TAG_base_type)
     <131>   DW_AT_byte_size   : (data1) 4
     <132>   DW_AT_encoding    : (data1) 4	(float)
-    <133>   DW_AT_name        : (strp) (offset: 0x2ae8): float
+    <133>   DW_AT_name        : (strp) (offset: 0x29e3): float
  <1><137>: Abbrev Number: 3 (DW_TAG_base_type)
     <138>   DW_AT_byte_size   : (data1) 8
     <139>   DW_AT_encoding    : (data1) 4	(float)
-    <13a>   DW_AT_name        : (strp) (offset: 0x2cbd): double
+    <13a>   DW_AT_name        : (strp) (offset: 0x2c0a): double
  <1><13e>: Abbrev Number: 10 (DW_TAG_structure_type)
-    <13f>   DW_AT_name        : (strp) (offset: 0x3dd4): timezone
+    <13f>   DW_AT_name        : (strp) (offset: 0x3d39): timezone
     <143>   DW_AT_byte_size   : (data1) 8
     <144>   DW_AT_decl_file   : (data1) 9
     <145>   DW_AT_decl_line   : (data1) 56
     <146>   DW_AT_decl_column : (data1) 8
     <147>   DW_AT_sibling     : (ref4) <0x166>
  <2><14b>: Abbrev Number: 11 (DW_TAG_member)
-    <14c>   DW_AT_name        : (strp) (offset: 0x4506): tz_minuteswest
+    <14c>   DW_AT_name        : (strp) (offset: 0x43da): tz_minuteswest
     <150>   DW_AT_decl_file   : (data1) 9
     <151>   DW_AT_decl_line   : (data1) 58
     <152>   DW_AT_decl_column : (data1) 9
     <153>   DW_AT_type        : (ref4) <0x5f>, int
     <157>   DW_AT_data_member_location: (data1) 0
  <2><158>: Abbrev Number: 11 (DW_TAG_member)
-    <159>   DW_AT_name        : (strp) (offset: 0x2873): tz_dsttime
+    <159>   DW_AT_name        : (strp) (offset: 0x27f7): tz_dsttime
     <15d>   DW_AT_decl_file   : (data1) 9
     <15e>   DW_AT_decl_line   : (data1) 59
     <15f>   DW_AT_decl_column : (data1) 9
     <160>   DW_AT_type        : (ref4) <0x5f>, int
     <164>   DW_AT_data_member_location: (data1) 4
  <2><165>: Abbrev Number: 0
  <1><166>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <167>   DW_AT_byte_size   : (data1) 8
     <168>   DW_AT_type        : (ref4) <0x13e>, timezone
  <1><16c>: Abbrev Number: 12 (DW_TAG_restrict_type)
     <16d>   DW_AT_type        : (ref4) <0x166>, timezone
  <1><171>: Abbrev Number: 2 (DW_TAG_typedef)
-    <172>   DW_AT_name        : (strp) (offset: 0xebf): PyTypeObject
+    <172>   DW_AT_name        : (strp) (offset: 0xe66): PyTypeObject
     <176>   DW_AT_decl_file   : (data1) 2
     <177>   DW_AT_decl_line   : (data1) 66
     <178>   DW_AT_decl_column : (data1) 28
     <179>   DW_AT_type        : (ref4) <0x182>, _typeobject
  <1><17d>: Abbrev Number: 5 (DW_TAG_const_type)
     <17e>   DW_AT_type        : (ref4) <0x171>, PyTypeObject, _typeobject
  <1><182>: Abbrev Number: 13 (DW_TAG_structure_type)
-    <183>   DW_AT_name        : (strp) (offset: 0x5c9): _typeobject
+    <183>   DW_AT_name        : (strp) (offset: 0x6cf): _typeobject
     <187>   DW_AT_byte_size   : (data2) 408
     <189>   DW_AT_decl_file   : (data1) 10
     <18a>   DW_AT_decl_line   : (data1) 193
     <18b>   DW_AT_decl_column : (data1) 8
     <18c>   DW_AT_sibling     : (ref4) <0x430>
  <2><190>: Abbrev Number: 11 (DW_TAG_member)
-    <191>   DW_AT_name        : (strp) (offset: 0xeb7): ob_base
+    <191>   DW_AT_name        : (strp) (offset: 0xe5e): ob_base
     <195>   DW_AT_decl_file   : (data1) 10
     <196>   DW_AT_decl_line   : (data1) 194
     <197>   DW_AT_decl_column : (data1) 5
     <198>   DW_AT_type        : (ref4) <0x493>, PyVarObject
     <19c>   DW_AT_data_member_location: (data1) 0
  <2><19d>: Abbrev Number: 11 (DW_TAG_member)
-    <19e>   DW_AT_name        : (strp) (offset: 0x2354): tp_name
+    <19e>   DW_AT_name        : (strp) (offset: 0x22a8): tp_name
     <1a2>   DW_AT_decl_file   : (data1) 10
     <1a3>   DW_AT_decl_line   : (data1) 195
     <1a4>   DW_AT_decl_column : (data1) 17
     <1a5>   DW_AT_type        : (ref4) <0x97>, char
     <1a9>   DW_AT_data_member_location: (data1) 24
  <2><1aa>: Abbrev Number: 11 (DW_TAG_member)
-    <1ab>   DW_AT_name        : (strp) (offset: 0x441f): tp_basicsize
+    <1ab>   DW_AT_name        : (strp) (offset: 0x4378): tp_basicsize
     <1af>   DW_AT_decl_file   : (data1) 10
     <1b0>   DW_AT_decl_line   : (data1) 196
     <1b1>   DW_AT_decl_column : (data1) 16
     <1b2>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1b6>   DW_AT_data_member_location: (data1) 32
  <2><1b7>: Abbrev Number: 11 (DW_TAG_member)
-    <1b8>   DW_AT_name        : (strp) (offset: 0x368): tp_itemsize
+    <1b8>   DW_AT_name        : (strp) (offset: 0x39e): tp_itemsize
     <1bc>   DW_AT_decl_file   : (data1) 10
     <1bd>   DW_AT_decl_line   : (data1) 196
     <1be>   DW_AT_decl_column : (data1) 30
     <1bf>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1c3>   DW_AT_data_member_location: (data1) 40
  <2><1c4>: Abbrev Number: 11 (DW_TAG_member)
-    <1c5>   DW_AT_name        : (strp) (offset: 0x578): tp_dealloc
+    <1c5>   DW_AT_name        : (strp) (offset: 0x67e): tp_dealloc
     <1c9>   DW_AT_decl_file   : (data1) 10
     <1ca>   DW_AT_decl_line   : (data1) 200
     <1cb>   DW_AT_decl_column : (data1) 16
     <1cc>   DW_AT_type        : (ref4) <0x66e>, destructor
     <1d0>   DW_AT_data_member_location: (data1) 48
  <2><1d1>: Abbrev Number: 11 (DW_TAG_member)
-    <1d2>   DW_AT_name        : (strp) (offset: 0x2b93): tp_vectorcall_offset
+    <1d2>   DW_AT_name        : (strp) (offset: 0x2afc): tp_vectorcall_offset
     <1d6>   DW_AT_decl_file   : (data1) 10
     <1d7>   DW_AT_decl_line   : (data1) 201
     <1d8>   DW_AT_decl_column : (data1) 16
     <1d9>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <1dd>   DW_AT_data_member_location: (data1) 56
  <2><1de>: Abbrev Number: 11 (DW_TAG_member)
     <1df>   DW_AT_name        : (strp) (offset: 0x11a): tp_getattr
     <1e3>   DW_AT_decl_file   : (data1) 10
     <1e4>   DW_AT_decl_line   : (data1) 202
     <1e5>   DW_AT_decl_column : (data1) 17
     <1e6>   DW_AT_type        : (ref4) <0x68b>, getattrfunc, PyObject, _object
     <1ea>   DW_AT_data_member_location: (data1) 64
  <2><1eb>: Abbrev Number: 11 (DW_TAG_member)
-    <1ec>   DW_AT_name        : (strp) (offset: 0x1001): tp_setattr
+    <1ec>   DW_AT_name        : (strp) (offset: 0xfe0): tp_setattr
     <1f0>   DW_AT_decl_file   : (data1) 10
     <1f1>   DW_AT_decl_line   : (data1) 203
     <1f2>   DW_AT_decl_column : (data1) 17
     <1f3>   DW_AT_type        : (ref4) <0x6bd>, setattrfunc, int
     <1f7>   DW_AT_data_member_location: (data1) 72
  <2><1f8>: Abbrev Number: 11 (DW_TAG_member)
-    <1f9>   DW_AT_name        : (strp) (offset: 0x231): tp_as_async
+    <1f9>   DW_AT_name        : (strp) (offset: 0x267): tp_as_async
     <1fd>   DW_AT_decl_file   : (data1) 10
     <1fe>   DW_AT_decl_line   : (data1) 204
     <1ff>   DW_AT_decl_column : (data1) 21
     <200>   DW_AT_type        : (ref4) <0xc67>, PyAsyncMethods
     <204>   DW_AT_data_member_location: (data1) 80
  <2><205>: Abbrev Number: 11 (DW_TAG_member)
-    <206>   DW_AT_name        : (strp) (offset: 0x3dfd): tp_repr
+    <206>   DW_AT_name        : (strp) (offset: 0x3d62): tp_repr
     <20a>   DW_AT_decl_file   : (data1) 10
     <20b>   DW_AT_decl_line   : (data1) 206
     <20c>   DW_AT_decl_column : (data1) 14
     <20d>   DW_AT_type        : (ref4) <0x6f4>, reprfunc, PyObject, _object
     <211>   DW_AT_data_member_location: (data1) 88
  <2><212>: Abbrev Number: 11 (DW_TAG_member)
-    <213>   DW_AT_name        : (strp) (offset: 0x2cd9): tp_as_number
+    <213>   DW_AT_name        : (strp) (offset: 0x2c7c): tp_as_number
     <217>   DW_AT_decl_file   : (data1) 10
     <218>   DW_AT_decl_line   : (data1) 210
     <219>   DW_AT_decl_column : (data1) 22
     <21a>   DW_AT_type        : (ref4) <0xc6d>, PyNumberMethods
     <21e>   DW_AT_data_member_location: (data1) 96
  <2><21f>: Abbrev Number: 11 (DW_TAG_member)
-    <220>   DW_AT_name        : (strp) (offset: 0x2422): tp_as_sequence
+    <220>   DW_AT_name        : (strp) (offset: 0x2376): tp_as_sequence
     <224>   DW_AT_decl_file   : (data1) 10
     <225>   DW_AT_decl_line   : (data1) 211
     <226>   DW_AT_decl_column : (data1) 24
     <227>   DW_AT_type        : (ref4) <0xc73>, PySequenceMethods
     <22b>   DW_AT_data_member_location: (data1) 104
  <2><22c>: Abbrev Number: 11 (DW_TAG_member)
-    <22d>   DW_AT_name        : (strp) (offset: 0x14be): tp_as_mapping
+    <22d>   DW_AT_name        : (strp) (offset: 0x14b2): tp_as_mapping
     <231>   DW_AT_decl_file   : (data1) 10
     <232>   DW_AT_decl_line   : (data1) 212
     <233>   DW_AT_decl_column : (data1) 23
     <234>   DW_AT_type        : (ref4) <0xc79>, PyMappingMethods
     <238>   DW_AT_data_member_location: (data1) 112
  <2><239>: Abbrev Number: 11 (DW_TAG_member)
-    <23a>   DW_AT_name        : (strp) (offset: 0x31fc): tp_hash
+    <23a>   DW_AT_name        : (strp) (offset: 0x31de): tp_hash
     <23e>   DW_AT_decl_file   : (data1) 10
     <23f>   DW_AT_decl_line   : (data1) 216
     <240>   DW_AT_decl_column : (data1) 14
     <241>   DW_AT_type        : (ref4) <0x700>, hashfunc, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <245>   DW_AT_data_member_location: (data1) 120
  <2><246>: Abbrev Number: 11 (DW_TAG_member)
-    <247>   DW_AT_name        : (strp) (offset: 0xd55): tp_call
+    <247>   DW_AT_name        : (strp) (offset: 0xc78): tp_call
     <24b>   DW_AT_decl_file   : (data1) 10
     <24c>   DW_AT_decl_line   : (data1) 217
     <24d>   DW_AT_decl_column : (data1) 17
     <24e>   DW_AT_type        : (ref4) <0x4f1>, ternaryfunc, PyObject, _object
     <252>   DW_AT_data_member_location: (data1) 128
  <2><253>: Abbrev Number: 11 (DW_TAG_member)
-    <254>   DW_AT_name        : (strp) (offset: 0xdee): tp_str
+    <254>   DW_AT_name        : (strp) (offset: 0xd95): tp_str
     <258>   DW_AT_decl_file   : (data1) 10
     <259>   DW_AT_decl_line   : (data1) 218
     <25a>   DW_AT_decl_column : (data1) 14
     <25b>   DW_AT_type        : (ref4) <0x6f4>, reprfunc, PyObject, _object
     <25f>   DW_AT_data_member_location: (data1) 136
  <2><260>: Abbrev Number: 11 (DW_TAG_member)
-    <261>   DW_AT_name        : (strp) (offset: 0x271d): tp_getattro
+    <261>   DW_AT_name        : (strp) (offset: 0x266b): tp_getattro
     <265>   DW_AT_decl_file   : (data1) 10
     <266>   DW_AT_decl_line   : (data1) 219
     <267>   DW_AT_decl_column : (data1) 18
     <268>   DW_AT_type        : (ref4) <0x6b1>, getattrofunc, PyObject, _object
     <26c>   DW_AT_data_member_location: (data1) 144
  <2><26d>: Abbrev Number: 11 (DW_TAG_member)
-    <26e>   DW_AT_name        : (strp) (offset: 0x3672): tp_setattro
+    <26e>   DW_AT_name        : (strp) (offset: 0x35ed): tp_setattro
     <272>   DW_AT_decl_file   : (data1) 10
     <273>   DW_AT_decl_line   : (data1) 220
     <274>   DW_AT_decl_column : (data1) 18
     <275>   DW_AT_type        : (ref4) <0x6e8>, setattrofunc, int
     <279>   DW_AT_data_member_location: (data1) 152
  <2><27a>: Abbrev Number: 11 (DW_TAG_member)
-    <27b>   DW_AT_name        : (strp) (offset: 0x2449): tp_as_buffer
+    <27b>   DW_AT_name        : (strp) (offset: 0x239d): tp_as_buffer
     <27f>   DW_AT_decl_file   : (data1) 10
     <280>   DW_AT_decl_line   : (data1) 223
     <281>   DW_AT_decl_column : (data1) 20
     <282>   DW_AT_type        : (ref4) <0xc7f>, PyBufferProcs
     <286>   DW_AT_data_member_location: (data1) 160
  <2><287>: Abbrev Number: 11 (DW_TAG_member)
-    <288>   DW_AT_name        : (strp) (offset: 0x4060): tp_flags
+    <288>   DW_AT_name        : (strp) (offset: 0x3ffe): tp_flags
     <28c>   DW_AT_decl_file   : (data1) 10
     <28d>   DW_AT_decl_line   : (data1) 226
     <28e>   DW_AT_decl_column : (data1) 19
     <28f>   DW_AT_type        : (ref4) <0x35>, long unsigned int
     <293>   DW_AT_data_member_location: (data1) 168
  <2><294>: Abbrev Number: 11 (DW_TAG_member)
-    <295>   DW_AT_name        : (strp) (offset: 0x2e0f): tp_doc
+    <295>   DW_AT_name        : (strp) (offset: 0x2d86): tp_doc
     <299>   DW_AT_decl_file   : (data1) 10
     <29a>   DW_AT_decl_line   : (data1) 228
     <29b>   DW_AT_decl_column : (data1) 17
     <29c>   DW_AT_type        : (ref4) <0x97>, char
     <2a0>   DW_AT_data_member_location: (data1) 176
  <2><2a1>: Abbrev Number: 11 (DW_TAG_member)
-    <2a2>   DW_AT_name        : (strp) (offset: 0x3500): tp_traverse
+    <2a2>   DW_AT_name        : (strp) (offset: 0x349a): tp_traverse
     <2a6>   DW_AT_decl_file   : (data1) 10
     <2a7>   DW_AT_decl_line   : (data1) 232
     <2a8>   DW_AT_decl_column : (data1) 18
     <2a9>   DW_AT_type        : (ref4) <0x626>, traverseproc, int
     <2ad>   DW_AT_data_member_location: (data1) 184
  <2><2ae>: Abbrev Number: 11 (DW_TAG_member)
-    <2af>   DW_AT_name        : (strp) (offset: 0x1222): tp_clear
+    <2af>   DW_AT_name        : (strp) (offset: 0x123a): tp_clear
     <2b3>   DW_AT_decl_file   : (data1) 10
     <2b4>   DW_AT_decl_line   : (data1) 235
     <2b5>   DW_AT_decl_column : (data1) 13
     <2b6>   DW_AT_type        : (ref4) <0x51c>, inquiry, int
     <2ba>   DW_AT_data_member_location: (data1) 192
  <2><2bb>: Abbrev Number: 11 (DW_TAG_member)
-    <2bc>   DW_AT_name        : (strp) (offset: 0x827): tp_richcompare
+    <2bc>   DW_AT_name        : (strp) (offset: 0x86b): tp_richcompare
     <2c0>   DW_AT_decl_file   : (data1) 10
     <2c1>   DW_AT_decl_line   : (data1) 239
     <2c2>   DW_AT_decl_column : (data1) 17
     <2c3>   DW_AT_type        : (ref4) <0x721>, richcmpfunc, PyObject, _object
     <2c7>   DW_AT_data_member_location: (data1) 200
  <2><2c8>: Abbrev Number: 11 (DW_TAG_member)
-    <2c9>   DW_AT_name        : (strp) (offset: 0x2d3d): tp_weaklistoffset
+    <2c9>   DW_AT_name        : (strp) (offset: 0x2cb4): tp_weaklistoffset
     <2cd>   DW_AT_decl_file   : (data1) 10
     <2ce>   DW_AT_decl_line   : (data1) 242
     <2cf>   DW_AT_decl_column : (data1) 16
     <2d0>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <2d4>   DW_AT_data_member_location: (data1) 208
  <2><2d5>: Abbrev Number: 11 (DW_TAG_member)
-    <2d6>   DW_AT_name        : (strp) (offset: 0x37e6): tp_iter
+    <2d6>   DW_AT_name        : (strp) (offset: 0x3738): tp_iter
     <2da>   DW_AT_decl_file   : (data1) 10
     <2db>   DW_AT_decl_line   : (data1) 245
     <2dc>   DW_AT_decl_column : (data1) 17
     <2dd>   DW_AT_type        : (ref4) <0x74c>, getiterfunc, PyObject, _object
     <2e1>   DW_AT_data_member_location: (data1) 216
  <2><2e2>: Abbrev Number: 11 (DW_TAG_member)
-    <2e3>   DW_AT_name        : (strp) (offset: 0x373d): tp_iternext
+    <2e3>   DW_AT_name        : (strp) (offset: 0x368f): tp_iternext
     <2e7>   DW_AT_decl_file   : (data1) 10
     <2e8>   DW_AT_decl_line   : (data1) 246
     <2e9>   DW_AT_decl_column : (data1) 18
     <2ea>   DW_AT_type        : (ref4) <0x758>, iternextfunc, PyObject, _object
     <2ee>   DW_AT_data_member_location: (data1) 224
  <2><2ef>: Abbrev Number: 11 (DW_TAG_member)
-    <2f0>   DW_AT_name        : (strp) (offset: 0x27e9): tp_methods
+    <2f0>   DW_AT_name        : (strp) (offset: 0x276d): tp_methods
     <2f4>   DW_AT_decl_file   : (data1) 10
     <2f5>   DW_AT_decl_line   : (data1) 249
     <2f6>   DW_AT_decl_column : (data1) 25
     <2f7>   DW_AT_type        : (ref4) <0xcc7>, PyMethodDef
     <2fb>   DW_AT_data_member_location: (data1) 232
  <2><2fc>: Abbrev Number: 11 (DW_TAG_member)
-    <2fd>   DW_AT_name        : (strp) (offset: 0x34e6): tp_members
+    <2fd>   DW_AT_name        : (strp) (offset: 0x3480): tp_members
     <301>   DW_AT_decl_file   : (data1) 10
     <302>   DW_AT_decl_line   : (data1) 250
     <303>   DW_AT_decl_column : (data1) 25
     <304>   DW_AT_type        : (ref4) <0xd1c>, PyMemberDef
     <308>   DW_AT_data_member_location: (data1) 240
  <2><309>: Abbrev Number: 11 (DW_TAG_member)
-    <30a>   DW_AT_name        : (strp) (offset: 0x36e5): tp_getset
+    <30a>   DW_AT_name        : (strp) (offset: 0x3660): tp_getset
     <30e>   DW_AT_decl_file   : (data1) 10
     <30f>   DW_AT_decl_line   : (data1) 251
     <310>   DW_AT_decl_column : (data1) 25
     <311>   DW_AT_type        : (ref4) <0xd71>, PyGetSetDef
     <315>   DW_AT_data_member_location: (data1) 248
  <2><316>: Abbrev Number: 14 (DW_TAG_member)
-    <317>   DW_AT_name        : (strp) (offset: 0x38f7): tp_base
+    <317>   DW_AT_name        : (strp) (offset: 0x381f): tp_base
     <31b>   DW_AT_decl_file   : (data1) 10
     <31c>   DW_AT_decl_line   : (data1) 252
     <31d>   DW_AT_decl_column : (data1) 25
     <31e>   DW_AT_type        : (ref4) <0xd77>, _typeobject
     <322>   DW_AT_data_member_location: (data2) 256
  <2><324>: Abbrev Number: 14 (DW_TAG_member)
-    <325>   DW_AT_name        : (strp) (offset: 0x149a): tp_dict
+    <325>   DW_AT_name        : (strp) (offset: 0x148e): tp_dict
     <329>   DW_AT_decl_file   : (data1) 10
     <32a>   DW_AT_decl_line   : (data1) 253
     <32b>   DW_AT_decl_column : (data1) 15
     <32c>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
     <330>   DW_AT_data_member_location: (data2) 264
  <2><332>: Abbrev Number: 14 (DW_TAG_member)
-    <333>   DW_AT_name        : (strp) (offset: 0x37d9): tp_descr_get
+    <333>   DW_AT_name        : (strp) (offset: 0x372b): tp_descr_get
     <337>   DW_AT_decl_file   : (data1) 10
     <338>   DW_AT_decl_line   : (data1) 254
     <339>   DW_AT_decl_column : (data1) 18
     <33a>   DW_AT_type        : (ref4) <0x764>, descrgetfunc, PyObject, _object
     <33e>   DW_AT_data_member_location: (data2) 272
  <2><340>: Abbrev Number: 14 (DW_TAG_member)
-    <341>   DW_AT_name        : (strp) (offset: 0x4343): tp_descr_set
+    <341>   DW_AT_name        : (strp) (offset: 0x429c): tp_descr_set
     <345>   DW_AT_decl_file   : (data1) 10
     <346>   DW_AT_decl_line   : (data1) 255
     <347>   DW_AT_decl_column : (data1) 18
     <348>   DW_AT_type        : (ref4) <0x770>, descrsetfunc, int
     <34c>   DW_AT_data_member_location: (data2) 280
  <2><34e>: Abbrev Number: 15 (DW_TAG_member)
-    <34f>   DW_AT_name        : (strp) (offset: 0x1138): tp_dictoffset
+    <34f>   DW_AT_name        : (strp) (offset: 0x1117): tp_dictoffset
     <353>   DW_AT_decl_file   : (data1) 10
     <354>   DW_AT_decl_line   : (data2) 256
     <356>   DW_AT_decl_column : (data1) 16
     <357>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <35b>   DW_AT_data_member_location: (data2) 288
  <2><35d>: Abbrev Number: 15 (DW_TAG_member)
-    <35e>   DW_AT_name        : (strp) (offset: 0x13e0): tp_init
+    <35e>   DW_AT_name        : (strp) (offset: 0x13e2): tp_init
     <362>   DW_AT_decl_file   : (data1) 10
     <363>   DW_AT_decl_line   : (data2) 257
     <365>   DW_AT_decl_column : (data1) 14
     <366>   DW_AT_type        : (ref4) <0x77c>, initproc, int
     <36a>   DW_AT_data_member_location: (data2) 296
  <2><36c>: Abbrev Number: 15 (DW_TAG_member)
-    <36d>   DW_AT_name        : (strp) (offset: 0x259c): tp_alloc
+    <36d>   DW_AT_name        : (strp) (offset: 0x24b6): tp_alloc
     <371>   DW_AT_decl_file   : (data1) 10
     <372>   DW_AT_decl_line   : (data2) 258
     <374>   DW_AT_decl_column : (data1) 15
     <375>   DW_AT_type        : (ref4) <0x7b3>, allocfunc, PyObject, _object
     <379>   DW_AT_data_member_location: (data2) 304
  <2><37b>: Abbrev Number: 15 (DW_TAG_member)
-    <37c>   DW_AT_name        : (strp) (offset: 0x2070): tp_new
+    <37c>   DW_AT_name        : (strp) (offset: 0x1feb): tp_new
     <380>   DW_AT_decl_file   : (data1) 10
     <381>   DW_AT_decl_line   : (data2) 259
     <383>   DW_AT_decl_column : (data1) 13
     <384>   DW_AT_type        : (ref4) <0x788>, newfunc, PyObject, _object
     <388>   DW_AT_data_member_location: (data2) 312
  <2><38a>: Abbrev Number: 15 (DW_TAG_member)
-    <38b>   DW_AT_name        : (strp) (offset: 0xb2f): tp_free
+    <38b>   DW_AT_name        : (strp) (offset: 0xb16): tp_free
     <38f>   DW_AT_decl_file   : (data1) 10
     <390>   DW_AT_decl_line   : (data2) 260
     <392>   DW_AT_decl_column : (data1) 14
     <393>   DW_AT_type        : (ref4) <0x651>, freefunc
     <397>   DW_AT_data_member_location: (data2) 320
  <2><399>: Abbrev Number: 15 (DW_TAG_member)
-    <39a>   DW_AT_name        : (strp) (offset: 0x2a0): tp_is_gc
+    <39a>   DW_AT_name        : (strp) (offset: 0x2d6): tp_is_gc
     <39e>   DW_AT_decl_file   : (data1) 10
     <39f>   DW_AT_decl_line   : (data2) 261
     <3a1>   DW_AT_decl_column : (data1) 13
     <3a2>   DW_AT_type        : (ref4) <0x51c>, inquiry, int
     <3a6>   DW_AT_data_member_location: (data2) 328
  <2><3a8>: Abbrev Number: 15 (DW_TAG_member)
-    <3a9>   DW_AT_name        : (strp) (offset: 0x413): tp_bases
+    <3a9>   DW_AT_name        : (strp) (offset: 0x4c8): tp_bases
     <3ad>   DW_AT_decl_file   : (data1) 10
     <3ae>   DW_AT_decl_line   : (data2) 262
     <3b0>   DW_AT_decl_column : (data1) 15
     <3b1>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
     <3b5>   DW_AT_data_member_location: (data2) 336
  <2><3b7>: Abbrev Number: 15 (DW_TAG_member)
-    <3b8>   DW_AT_name        : (strp) (offset: 0x2857): tp_mro
+    <3b8>   DW_AT_name        : (strp) (offset: 0x27db): tp_mro
     <3bc>   DW_AT_decl_file   : (data1) 10
     <3bd>   DW_AT_decl_line   : (data2) 263
     <3bf>   DW_AT_decl_column : (data1) 15
     <3c0>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
     <3c4>   DW_AT_data_member_location: (data2) 344
  <2><3c6>: Abbrev Number: 15 (DW_TAG_member)
-    <3c7>   DW_AT_name        : (strp) (offset: 0x3e2a): tp_cache
+    <3c7>   DW_AT_name        : (strp) (offset: 0x3d8f): tp_cache
     <3cb>   DW_AT_decl_file   : (data1) 10
     <3cc>   DW_AT_decl_line   : (data2) 264
     <3ce>   DW_AT_decl_column : (data1) 15
     <3cf>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
     <3d3>   DW_AT_data_member_location: (data2) 352
  <2><3d5>: Abbrev Number: 15 (DW_TAG_member)
-    <3d6>   DW_AT_name        : (strp) (offset: 0x3625): tp_subclasses
+    <3d6>   DW_AT_name        : (strp) (offset: 0x3598): tp_subclasses
     <3da>   DW_AT_decl_file   : (data1) 10
     <3db>   DW_AT_decl_line   : (data2) 265
     <3dd>   DW_AT_decl_column : (data1) 15
     <3de>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
     <3e2>   DW_AT_data_member_location: (data2) 360
  <2><3e4>: Abbrev Number: 15 (DW_TAG_member)
-    <3e5>   DW_AT_name        : (strp) (offset: 0x2f69): tp_weaklist
+    <3e5>   DW_AT_name        : (strp) (offset: 0x2ee0): tp_weaklist
     <3e9>   DW_AT_decl_file   : (data1) 10
     <3ea>   DW_AT_decl_line   : (data2) 266
     <3ec>   DW_AT_decl_column : (data1) 15
     <3ed>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
     <3f1>   DW_AT_data_member_location: (data2) 368
  <2><3f3>: Abbrev Number: 15 (DW_TAG_member)
-    <3f4>   DW_AT_name        : (strp) (offset: 0x22a4): tp_del
+    <3f4>   DW_AT_name        : (strp) (offset: 0x2263): tp_del
     <3f8>   DW_AT_decl_file   : (data1) 10
     <3f9>   DW_AT_decl_line   : (data2) 267
     <3fb>   DW_AT_decl_column : (data1) 16
     <3fc>   DW_AT_type        : (ref4) <0x66e>, destructor
     <400>   DW_AT_data_member_location: (data2) 376
  <2><402>: Abbrev Number: 15 (DW_TAG_member)
-    <403>   DW_AT_name        : (strp) (offset: 0x330f): tp_version_tag
+    <403>   DW_AT_name        : (strp) (offset: 0x32f1): tp_version_tag
     <407>   DW_AT_decl_file   : (data1) 10
     <408>   DW_AT_decl_line   : (data2) 270
     <40a>   DW_AT_decl_column : (data1) 18
     <40b>   DW_AT_type        : (ref4) <0x4a>, unsigned int
     <40f>   DW_AT_data_member_location: (data2) 384
  <2><411>: Abbrev Number: 15 (DW_TAG_member)
-    <412>   DW_AT_name        : (strp) (offset: 0x11af): tp_finalize
+    <412>   DW_AT_name        : (strp) (offset: 0x118e): tp_finalize
     <416>   DW_AT_decl_file   : (data1) 10
     <417>   DW_AT_decl_line   : (data2) 272
     <419>   DW_AT_decl_column : (data1) 16
     <41a>   DW_AT_type        : (ref4) <0x66e>, destructor
     <41e>   DW_AT_data_member_location: (data2) 392
  <2><420>: Abbrev Number: 15 (DW_TAG_member)
-    <421>   DW_AT_name        : (strp) (offset: 0x32a6): tp_vectorcall
+    <421>   DW_AT_name        : (strp) (offset: 0x3288): tp_vectorcall
     <425>   DW_AT_decl_file   : (data1) 10
     <426>   DW_AT_decl_line   : (data2) 273
     <428>   DW_AT_decl_column : (data1) 20
     <429>   DW_AT_type        : (ref4) <0x900>, vectorcallfunc, PyObject, _object
     <42d>   DW_AT_data_member_location: (data2) 400
  <2><42f>: Abbrev Number: 0
  <1><430>: Abbrev Number: 10 (DW_TAG_structure_type)
-    <431>   DW_AT_name        : (strp) (offset: 0xa32): _object
+    <431>   DW_AT_name        : (strp) (offset: 0xa24): _object
     <435>   DW_AT_byte_size   : (data1) 16
     <436>   DW_AT_decl_file   : (data1) 2
     <437>   DW_AT_decl_line   : (data1) 105
     <438>   DW_AT_decl_column : (data1) 16
     <439>   DW_AT_sibling     : (ref4) <0x458>
  <2><43d>: Abbrev Number: 11 (DW_TAG_member)
-    <43e>   DW_AT_name        : (strp) (offset: 0x183): ob_refcnt
+    <43e>   DW_AT_name        : (strp) (offset: 0x1b9): ob_refcnt
     <442>   DW_AT_decl_file   : (data1) 2
     <443>   DW_AT_decl_line   : (data1) 107
     <444>   DW_AT_decl_column : (data1) 16
     <445>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <449>   DW_AT_data_member_location: (data1) 0
  <2><44a>: Abbrev Number: 11 (DW_TAG_member)
-    <44b>   DW_AT_name        : (strp) (offset: 0xaf9): ob_type
+    <44b>   DW_AT_name        : (strp) (offset: 0xae0): ob_type
     <44f>   DW_AT_decl_file   : (data1) 2
     <450>   DW_AT_decl_line   : (data1) 108
     <451>   DW_AT_decl_column : (data1) 19
     <452>   DW_AT_type        : (ref4) <0x458>, PyTypeObject, _typeobject
     <456>   DW_AT_data_member_location: (data1) 8
  <2><457>: Abbrev Number: 0
  <1><458>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <459>   DW_AT_byte_size   : (data1) 8
     <45a>   DW_AT_type        : (ref4) <0x171>, PyTypeObject, _typeobject
  <1><45e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <45f>   DW_AT_name        : (strp) (offset: 0x1cde): PyObject
+    <45f>   DW_AT_name        : (strp) (offset: 0x1c2c): PyObject
     <463>   DW_AT_decl_file   : (data1) 2
     <464>   DW_AT_decl_line   : (data1) 109
     <465>   DW_AT_decl_column : (data1) 3
     <466>   DW_AT_type        : (ref4) <0x430>, _object
  <1><46a>: Abbrev Number: 5 (DW_TAG_const_type)
     <46b>   DW_AT_type        : (ref4) <0x45e>, PyObject, _object
  <1><46f>: Abbrev Number: 16 (DW_TAG_structure_type)
     <470>   DW_AT_byte_size   : (data1) 24
     <471>   DW_AT_decl_file   : (data1) 2
     <472>   DW_AT_decl_line   : (data1) 115
     <473>   DW_AT_decl_column : (data1) 9
     <474>   DW_AT_sibling     : (ref4) <0x493>
  <2><478>: Abbrev Number: 11 (DW_TAG_member)
-    <479>   DW_AT_name        : (strp) (offset: 0xeb7): ob_base
+    <479>   DW_AT_name        : (strp) (offset: 0xe5e): ob_base
     <47d>   DW_AT_decl_file   : (data1) 2
     <47e>   DW_AT_decl_line   : (data1) 116
     <47f>   DW_AT_decl_column : (data1) 14
     <480>   DW_AT_type        : (ref4) <0x45e>, PyObject, _object
     <484>   DW_AT_data_member_location: (data1) 0
  <2><485>: Abbrev Number: 11 (DW_TAG_member)
-    <486>   DW_AT_name        : (strp) (offset: 0x13fd): ob_size
+    <486>   DW_AT_name        : (strp) (offset: 0x143e): ob_size
     <48a>   DW_AT_decl_file   : (data1) 2
     <48b>   DW_AT_decl_line   : (data1) 117
     <48c>   DW_AT_decl_column : (data1) 16
     <48d>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <491>   DW_AT_data_member_location: (data1) 16
  <2><492>: Abbrev Number: 0
  <1><493>: Abbrev Number: 2 (DW_TAG_typedef)
-    <494>   DW_AT_name        : (strp) (offset: 0xbb6): PyVarObject
+    <494>   DW_AT_name        : (strp) (offset: 0xb65): PyVarObject
     <498>   DW_AT_decl_file   : (data1) 2
     <499>   DW_AT_decl_line   : (data1) 118
     <49a>   DW_AT_decl_column : (data1) 3
     <49b>   DW_AT_type        : (ref4) <0x46f>
  <1><49f>: Abbrev Number: 2 (DW_TAG_typedef)
-    <4a0>   DW_AT_name        : (strp) (offset: 0x2a1e): unaryfunc
+    <4a0>   DW_AT_name        : (strp) (offset: 0x295b): unaryfunc
     <4a4>   DW_AT_decl_file   : (data1) 2
     <4a5>   DW_AT_decl_line   : (data1) 163
     <4a6>   DW_AT_decl_column : (data1) 22
     <4a7>   DW_AT_type        : (ref4) <0x4ab>, PyObject, _object
  <1><4ab>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <4ac>   DW_AT_byte_size   : (data1) 8
     <4ad>   DW_AT_type        : (ref4) <0x4b1>, PyObject, _object
@@ -621,15 +621,15 @@
  <2><4bf>: Abbrev Number: 0
  <1><4c0>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <4c1>   DW_AT_byte_size   : (data1) 8
     <4c2>   DW_AT_type        : (ref4) <0x45e>, PyObject, _object
  <1><4c6>: Abbrev Number: 5 (DW_TAG_const_type)
     <4c7>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <1><4cb>: Abbrev Number: 2 (DW_TAG_typedef)
-    <4cc>   DW_AT_name        : (strp) (offset: 0x1583): binaryfunc
+    <4cc>   DW_AT_name        : (strp) (offset: 0x1577): binaryfunc
     <4d0>   DW_AT_decl_file   : (data1) 2
     <4d1>   DW_AT_decl_line   : (data1) 164
     <4d2>   DW_AT_decl_column : (data1) 22
     <4d3>   DW_AT_type        : (ref4) <0x4d7>, PyObject, _object
  <1><4d7>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <4d8>   DW_AT_byte_size   : (data1) 8
     <4d9>   DW_AT_type        : (ref4) <0x4dd>, PyObject, _object
@@ -639,15 +639,15 @@
     <4e2>   DW_AT_sibling     : (ref4) <0x4f1>
  <2><4e6>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <4e7>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><4eb>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <4ec>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><4f0>: Abbrev Number: 0
  <1><4f1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <4f2>   DW_AT_name        : (strp) (offset: 0xe9f): ternaryfunc
+    <4f2>   DW_AT_name        : (strp) (offset: 0xe46): ternaryfunc
     <4f6>   DW_AT_decl_file   : (data1) 2
     <4f7>   DW_AT_decl_line   : (data1) 165
     <4f8>   DW_AT_decl_column : (data1) 22
     <4f9>   DW_AT_type        : (ref4) <0x4fd>, PyObject, _object
  <1><4fd>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <4fe>   DW_AT_byte_size   : (data1) 8
     <4ff>   DW_AT_type        : (ref4) <0x503>, PyObject, _object
@@ -659,15 +659,15 @@
     <50d>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><511>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <512>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><516>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <517>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><51b>: Abbrev Number: 0
  <1><51c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <51d>   DW_AT_name        : (strp) (offset: 0x2ba8): inquiry
+    <51d>   DW_AT_name        : (strp) (offset: 0x2b53): inquiry
     <521>   DW_AT_decl_file   : (data1) 2
     <522>   DW_AT_decl_line   : (data1) 166
     <523>   DW_AT_decl_column : (data1) 15
     <524>   DW_AT_type        : (ref4) <0x528>, int
  <1><528>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <529>   DW_AT_byte_size   : (data1) 8
     <52a>   DW_AT_type        : (ref4) <0x52e>, int
@@ -691,15 +691,15 @@
     <550>   DW_AT_prototyped  : (flag_present) 1
     <550>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <554>   DW_AT_sibling     : (ref4) <0x55e>
  <2><558>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <559>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><55d>: Abbrev Number: 0
  <1><55e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <55f>   DW_AT_name        : (strp) (offset: 0x16d7): ssizeargfunc
+    <55f>   DW_AT_name        : (strp) (offset: 0x168b): ssizeargfunc
     <563>   DW_AT_decl_file   : (data1) 2
     <564>   DW_AT_decl_line   : (data1) 168
     <565>   DW_AT_decl_column : (data1) 21
     <566>   DW_AT_type        : (ref4) <0x56a>, PyObject, _object
  <1><56a>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <56b>   DW_AT_byte_size   : (data1) 8
     <56c>   DW_AT_type        : (ref4) <0x570>, PyObject, _object
@@ -709,15 +709,15 @@
     <575>   DW_AT_sibling     : (ref4) <0x584>
  <2><579>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <57a>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><57e>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <57f>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><583>: Abbrev Number: 0
  <1><584>: Abbrev Number: 2 (DW_TAG_typedef)
-    <585>   DW_AT_name        : (strp) (offset: 0x3266): ssizeobjargproc
+    <585>   DW_AT_name        : (strp) (offset: 0x3248): ssizeobjargproc
     <589>   DW_AT_decl_file   : (data1) 2
     <58a>   DW_AT_decl_line   : (data1) 170
     <58b>   DW_AT_decl_column : (data1) 14
     <58c>   DW_AT_type        : (ref4) <0x590>, int
  <1><590>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <591>   DW_AT_byte_size   : (data1) 8
     <592>   DW_AT_type        : (ref4) <0x596>, int
@@ -729,15 +729,15 @@
     <5a0>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5a4>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <5a5>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><5a9>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <5aa>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5ae>: Abbrev Number: 0
  <1><5af>: Abbrev Number: 2 (DW_TAG_typedef)
-    <5b0>   DW_AT_name        : (strp) (offset: 0x13ef): objobjargproc
+    <5b0>   DW_AT_name        : (strp) (offset: 0x1430): objobjargproc
     <5b4>   DW_AT_decl_file   : (data1) 2
     <5b5>   DW_AT_decl_line   : (data1) 172
     <5b6>   DW_AT_decl_column : (data1) 14
     <5b7>   DW_AT_type        : (ref4) <0x5bb>, int
  <1><5bb>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <5bc>   DW_AT_byte_size   : (data1) 8
     <5bd>   DW_AT_type        : (ref4) <0x5c1>, int
@@ -749,15 +749,15 @@
     <5cb>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5cf>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <5d0>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5d4>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <5d5>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5d9>: Abbrev Number: 0
  <1><5da>: Abbrev Number: 2 (DW_TAG_typedef)
-    <5db>   DW_AT_name        : (strp) (offset: 0x4515): objobjproc
+    <5db>   DW_AT_name        : (strp) (offset: 0x43e9): objobjproc
     <5df>   DW_AT_decl_file   : (data1) 2
     <5e0>   DW_AT_decl_line   : (data1) 174
     <5e1>   DW_AT_decl_column : (data1) 15
     <5e2>   DW_AT_type        : (ref4) <0x5e6>, int
  <1><5e6>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <5e7>   DW_AT_byte_size   : (data1) 8
     <5e8>   DW_AT_type        : (ref4) <0x5ec>, int
@@ -767,15 +767,15 @@
     <5f1>   DW_AT_sibling     : (ref4) <0x600>
  <2><5f5>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <5f6>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5fa>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <5fb>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><5ff>: Abbrev Number: 0
  <1><600>: Abbrev Number: 2 (DW_TAG_typedef)
-    <601>   DW_AT_name        : (strp) (offset: 0x960): visitproc
+    <601>   DW_AT_name        : (strp) (offset: 0x91f): visitproc
     <605>   DW_AT_decl_file   : (data1) 2
     <606>   DW_AT_decl_line   : (data1) 175
     <607>   DW_AT_decl_column : (data1) 15
     <608>   DW_AT_type        : (ref4) <0x60c>, int
  <1><60c>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <60d>   DW_AT_byte_size   : (data1) 8
     <60e>   DW_AT_type        : (ref4) <0x612>, int
@@ -785,15 +785,15 @@
     <617>   DW_AT_sibling     : (ref4) <0x626>
  <2><61b>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <61c>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><620>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <621>   DW_AT_type        : (ref4) <0x77>
  <2><625>: Abbrev Number: 0
  <1><626>: Abbrev Number: 2 (DW_TAG_typedef)
-    <627>   DW_AT_name        : (strp) (offset: 0x2b30): traverseproc
+    <627>   DW_AT_name        : (strp) (offset: 0x2a6c): traverseproc
     <62b>   DW_AT_decl_file   : (data1) 2
     <62c>   DW_AT_decl_line   : (data1) 176
     <62d>   DW_AT_decl_column : (data1) 15
     <62e>   DW_AT_type        : (ref4) <0x632>, int
  <1><632>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <633>   DW_AT_byte_size   : (data1) 8
     <634>   DW_AT_type        : (ref4) <0x638>, int
@@ -805,45 +805,45 @@
     <642>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><646>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <647>   DW_AT_type        : (ref4) <0x600>, visitproc, int
  <2><64b>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <64c>   DW_AT_type        : (ref4) <0x77>
  <2><650>: Abbrev Number: 0
  <1><651>: Abbrev Number: 2 (DW_TAG_typedef)
-    <652>   DW_AT_name        : (strp) (offset: 0x367e): freefunc
+    <652>   DW_AT_name        : (strp) (offset: 0x35f9): freefunc
     <656>   DW_AT_decl_file   : (data1) 2
     <657>   DW_AT_decl_line   : (data1) 179
     <658>   DW_AT_decl_column : (data1) 16
     <659>   DW_AT_type        : (ref4) <0x65d>
  <1><65d>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <65e>   DW_AT_byte_size   : (data1) 8
     <65f>   DW_AT_type        : (ref4) <0x663>
  <1><663>: Abbrev Number: 19 (DW_TAG_subroutine_type)
     <664>   DW_AT_prototyped  : (flag_present) 1
     <664>   DW_AT_sibling     : (ref4) <0x66e>
  <2><668>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <669>   DW_AT_type        : (ref4) <0x77>
  <2><66d>: Abbrev Number: 0
  <1><66e>: Abbrev Number: 2 (DW_TAG_typedef)
-    <66f>   DW_AT_name        : (strp) (offset: 0x215d): destructor
+    <66f>   DW_AT_name        : (strp) (offset: 0x2116): destructor
     <673>   DW_AT_decl_file   : (data1) 2
     <674>   DW_AT_decl_line   : (data1) 180
     <675>   DW_AT_decl_column : (data1) 16
     <676>   DW_AT_type        : (ref4) <0x67a>
  <1><67a>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <67b>   DW_AT_byte_size   : (data1) 8
     <67c>   DW_AT_type        : (ref4) <0x680>
  <1><680>: Abbrev Number: 19 (DW_TAG_subroutine_type)
     <681>   DW_AT_prototyped  : (flag_present) 1
     <681>   DW_AT_sibling     : (ref4) <0x68b>
  <2><685>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <686>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><68a>: Abbrev Number: 0
  <1><68b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <68c>   DW_AT_name        : (strp) (offset: 0x300c): getattrfunc
+    <68c>   DW_AT_name        : (strp) (offset: 0x2fb2): getattrfunc
     <690>   DW_AT_decl_file   : (data1) 2
     <691>   DW_AT_decl_line   : (data1) 181
     <692>   DW_AT_decl_column : (data1) 21
     <693>   DW_AT_type        : (ref4) <0x697>, PyObject, _object
  <1><697>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <698>   DW_AT_byte_size   : (data1) 8
     <699>   DW_AT_type        : (ref4) <0x69d>, PyObject, _object
@@ -853,21 +853,21 @@
     <6a2>   DW_AT_sibling     : (ref4) <0x6b1>
  <2><6a6>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <6a7>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><6ab>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <6ac>   DW_AT_type        : (ref4) <0x85>, char
  <2><6b0>: Abbrev Number: 0
  <1><6b1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6b2>   DW_AT_name        : (strp) (offset: 0x2e2e): getattrofunc
+    <6b2>   DW_AT_name        : (strp) (offset: 0x2da5): getattrofunc
     <6b6>   DW_AT_decl_file   : (data1) 2
     <6b7>   DW_AT_decl_line   : (data1) 182
     <6b8>   DW_AT_decl_column : (data1) 21
     <6b9>   DW_AT_type        : (ref4) <0x4d7>, PyObject, _object
  <1><6bd>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6be>   DW_AT_name        : (strp) (offset: 0x14e6): setattrfunc
+    <6be>   DW_AT_name        : (strp) (offset: 0x14da): setattrfunc
     <6c2>   DW_AT_decl_file   : (data1) 2
     <6c3>   DW_AT_decl_line   : (data1) 183
     <6c4>   DW_AT_decl_column : (data1) 15
     <6c5>   DW_AT_type        : (ref4) <0x6c9>, int
  <1><6c9>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <6ca>   DW_AT_byte_size   : (data1) 8
     <6cb>   DW_AT_type        : (ref4) <0x6cf>, int
@@ -879,27 +879,27 @@
     <6d9>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><6dd>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <6de>   DW_AT_type        : (ref4) <0x85>, char
  <2><6e2>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <6e3>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><6e7>: Abbrev Number: 0
  <1><6e8>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6e9>   DW_AT_name        : (strp) (offset: 0x518): setattrofunc
+    <6e9>   DW_AT_name        : (strp) (offset: 0x61e): setattrofunc
     <6ed>   DW_AT_decl_file   : (data1) 2
     <6ee>   DW_AT_decl_line   : (data1) 184
     <6ef>   DW_AT_decl_column : (data1) 15
     <6f0>   DW_AT_type        : (ref4) <0x5bb>, int
  <1><6f4>: Abbrev Number: 2 (DW_TAG_typedef)
-    <6f5>   DW_AT_name        : (strp) (offset: 0x196b): reprfunc
+    <6f5>   DW_AT_name        : (strp) (offset: 0x195a): reprfunc
     <6f9>   DW_AT_decl_file   : (data1) 2
     <6fa>   DW_AT_decl_line   : (data1) 185
     <6fb>   DW_AT_decl_column : (data1) 21
     <6fc>   DW_AT_type        : (ref4) <0x4ab>, PyObject, _object
  <1><700>: Abbrev Number: 2 (DW_TAG_typedef)
-    <701>   DW_AT_name        : (strp) (offset: 0x2fef): hashfunc
+    <701>   DW_AT_name        : (strp) (offset: 0x2f95): hashfunc
     <705>   DW_AT_decl_file   : (data1) 2
     <706>   DW_AT_decl_line   : (data1) 186
     <707>   DW_AT_decl_column : (data1) 21
     <708>   DW_AT_type        : (ref4) <0x70c>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><70c>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <70d>   DW_AT_byte_size   : (data1) 8
     <70e>   DW_AT_type        : (ref4) <0x712>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
@@ -907,15 +907,15 @@
     <713>   DW_AT_prototyped  : (flag_present) 1
     <713>   DW_AT_type        : (ref4) <0x124>, Py_hash_t, Py_ssize_t, ssize_t, __ssize_t, long int
     <717>   DW_AT_sibling     : (ref4) <0x721>
  <2><71b>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <71c>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><720>: Abbrev Number: 0
  <1><721>: Abbrev Number: 2 (DW_TAG_typedef)
-    <722>   DW_AT_name        : (strp) (offset: 0x106e): richcmpfunc
+    <722>   DW_AT_name        : (strp) (offset: 0x104d): richcmpfunc
     <726>   DW_AT_decl_file   : (data1) 2
     <727>   DW_AT_decl_line   : (data1) 187
     <728>   DW_AT_decl_column : (data1) 21
     <729>   DW_AT_type        : (ref4) <0x72d>, PyObject, _object
  <1><72d>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <72e>   DW_AT_byte_size   : (data1) 8
     <72f>   DW_AT_type        : (ref4) <0x733>, PyObject, _object
@@ -927,45 +927,45 @@
     <73d>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><741>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <742>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><746>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <747>   DW_AT_type        : (ref4) <0x5f>, int
  <2><74b>: Abbrev Number: 0
  <1><74c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <74d>   DW_AT_name        : (strp) (offset: 0x16cb): getiterfunc
+    <74d>   DW_AT_name        : (strp) (offset: 0x167f): getiterfunc
     <751>   DW_AT_decl_file   : (data1) 2
     <752>   DW_AT_decl_line   : (data1) 188
     <753>   DW_AT_decl_column : (data1) 21
     <754>   DW_AT_type        : (ref4) <0x4ab>, PyObject, _object
  <1><758>: Abbrev Number: 2 (DW_TAG_typedef)
-    <759>   DW_AT_name        : (strp) (offset: 0x42c0): iternextfunc
+    <759>   DW_AT_name        : (strp) (offset: 0x4219): iternextfunc
     <75d>   DW_AT_decl_file   : (data1) 2
     <75e>   DW_AT_decl_line   : (data1) 189
     <75f>   DW_AT_decl_column : (data1) 21
     <760>   DW_AT_type        : (ref4) <0x4ab>, PyObject, _object
  <1><764>: Abbrev Number: 2 (DW_TAG_typedef)
-    <765>   DW_AT_name        : (strp) (offset: 0x17b9): descrgetfunc
+    <765>   DW_AT_name        : (strp) (offset: 0x176d): descrgetfunc
     <769>   DW_AT_decl_file   : (data1) 2
     <76a>   DW_AT_decl_line   : (data1) 190
     <76b>   DW_AT_decl_column : (data1) 21
     <76c>   DW_AT_type        : (ref4) <0x4fd>, PyObject, _object
  <1><770>: Abbrev Number: 2 (DW_TAG_typedef)
-    <771>   DW_AT_name        : (strp) (offset: 0x172b): descrsetfunc
+    <771>   DW_AT_name        : (strp) (offset: 0x16df): descrsetfunc
     <775>   DW_AT_decl_file   : (data1) 2
     <776>   DW_AT_decl_line   : (data1) 191
     <777>   DW_AT_decl_column : (data1) 15
     <778>   DW_AT_type        : (ref4) <0x5bb>, int
  <1><77c>: Abbrev Number: 2 (DW_TAG_typedef)
-    <77d>   DW_AT_name        : (strp) (offset: 0x3e4): initproc
+    <77d>   DW_AT_name        : (strp) (offset: 0x41a): initproc
     <781>   DW_AT_decl_file   : (data1) 2
     <782>   DW_AT_decl_line   : (data1) 192
     <783>   DW_AT_decl_column : (data1) 15
     <784>   DW_AT_type        : (ref4) <0x5bb>, int
  <1><788>: Abbrev Number: 2 (DW_TAG_typedef)
-    <789>   DW_AT_name        : (strp) (offset: 0x2fbe): newfunc
+    <789>   DW_AT_name        : (strp) (offset: 0x2f35): newfunc
     <78d>   DW_AT_decl_file   : (data1) 2
     <78e>   DW_AT_decl_line   : (data1) 193
     <78f>   DW_AT_decl_column : (data1) 21
     <790>   DW_AT_type        : (ref4) <0x794>, PyObject, _object
  <1><794>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <795>   DW_AT_byte_size   : (data1) 8
     <796>   DW_AT_type        : (ref4) <0x79a>, PyObject, _object
@@ -977,15 +977,15 @@
     <7a4>   DW_AT_type        : (ref4) <0x458>, PyTypeObject, _typeobject
  <2><7a8>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <7a9>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><7ad>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <7ae>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><7b2>: Abbrev Number: 0
  <1><7b3>: Abbrev Number: 2 (DW_TAG_typedef)
-    <7b4>   DW_AT_name        : (strp) (offset: 0x2733): allocfunc
+    <7b4>   DW_AT_name        : (strp) (offset: 0x2681): allocfunc
     <7b8>   DW_AT_decl_file   : (data1) 2
     <7b9>   DW_AT_decl_line   : (data1) 194
     <7ba>   DW_AT_decl_column : (data1) 21
     <7bb>   DW_AT_type        : (ref4) <0x7bf>, PyObject, _object
  <1><7bf>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <7c0>   DW_AT_byte_size   : (data1) 8
     <7c1>   DW_AT_type        : (ref4) <0x7c5>, PyObject, _object
@@ -995,39 +995,39 @@
     <7ca>   DW_AT_sibling     : (ref4) <0x7d9>
  <2><7ce>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <7cf>   DW_AT_type        : (ref4) <0x458>, PyTypeObject, _typeobject
  <2><7d3>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <7d4>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
  <2><7d8>: Abbrev Number: 0
  <1><7d9>: Abbrev Number: 20 (DW_TAG_variable)
-    <7da>   DW_AT_name        : (strp) (offset: 0x4162): PyType_Type
+    <7da>   DW_AT_name        : (strp) (offset: 0x40b6): PyType_Type
     <7de>   DW_AT_decl_file   : (data1) 2
     <7df>   DW_AT_decl_line   : (data1) 227
     <7e0>   DW_AT_decl_column : (data1) 26
     <7e1>   DW_AT_type        : (ref4) <0x171>, PyTypeObject, _typeobject
     <7e5>   DW_AT_external    : (flag_present) 1
     <7e5>   DW_AT_declaration : (flag_present) 1
  <1><7e5>: Abbrev Number: 20 (DW_TAG_variable)
-    <7e6>   DW_AT_name        : (strp) (offset: 0x1e5): PyBaseObject_Type
+    <7e6>   DW_AT_name        : (strp) (offset: 0x21b): PyBaseObject_Type
     <7ea>   DW_AT_decl_file   : (data1) 2
     <7eb>   DW_AT_decl_line   : (data1) 228
     <7ec>   DW_AT_decl_column : (data1) 26
     <7ed>   DW_AT_type        : (ref4) <0x171>, PyTypeObject, _typeobject
     <7f1>   DW_AT_external    : (flag_present) 1
     <7f1>   DW_AT_declaration : (flag_present) 1
  <1><7f1>: Abbrev Number: 21 (DW_TAG_variable)
-    <7f2>   DW_AT_name        : (strp) (offset: 0x3f09): _Py_NoneStruct
+    <7f2>   DW_AT_name        : (strp) (offset: 0x3e6e): _Py_NoneStruct
     <7f6>   DW_AT_decl_file   : (data1) 2
     <7f7>   DW_AT_decl_line   : (data2) 516
     <7f9>   DW_AT_decl_column : (data1) 22
     <7fa>   DW_AT_type        : (ref4) <0x45e>, PyObject, _object
     <7fe>   DW_AT_external    : (flag_present) 1
     <7fe>   DW_AT_declaration : (flag_present) 1
  <1><7fe>: Abbrev Number: 10 (DW_TAG_structure_type)
-    <7ff>   DW_AT_name        : (strp) (offset: 0x2f75): bufferinfo
+    <7ff>   DW_AT_name        : (strp) (offset: 0x2eec): bufferinfo
     <803>   DW_AT_byte_size   : (data1) 80
     <804>   DW_AT_decl_file   : (data1) 10
     <805>   DW_AT_decl_line   : (data1) 56
     <806>   DW_AT_decl_column : (data1) 16
     <807>   DW_AT_sibling     : (ref4) <0x89b>
  <2><80b>: Abbrev Number: 22 (DW_TAG_member)
     <80c>   DW_AT_name        : (string) buf
@@ -1047,81 +1047,81 @@
     <826>   DW_AT_name        : (string) len
     <82a>   DW_AT_decl_file   : (data1) 10
     <82b>   DW_AT_decl_line   : (data1) 59
     <82c>   DW_AT_decl_column : (data1) 16
     <82d>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <831>   DW_AT_data_member_location: (data1) 16
  <2><832>: Abbrev Number: 11 (DW_TAG_member)
-    <833>   DW_AT_name        : (strp) (offset: 0x36b): itemsize
+    <833>   DW_AT_name        : (strp) (offset: 0x3a1): itemsize
     <837>   DW_AT_decl_file   : (data1) 10
     <838>   DW_AT_decl_line   : (data1) 60
     <839>   DW_AT_decl_column : (data1) 16
     <83a>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <83e>   DW_AT_data_member_location: (data1) 24
  <2><83f>: Abbrev Number: 11 (DW_TAG_member)
-    <840>   DW_AT_name        : (strp) (offset: 0x2dfb): readonly
+    <840>   DW_AT_name        : (strp) (offset: 0x2d72): readonly
     <844>   DW_AT_decl_file   : (data1) 10
     <845>   DW_AT_decl_line   : (data1) 62
     <846>   DW_AT_decl_column : (data1) 9
     <847>   DW_AT_type        : (ref4) <0x5f>, int
     <84b>   DW_AT_data_member_location: (data1) 32
  <2><84c>: Abbrev Number: 11 (DW_TAG_member)
-    <84d>   DW_AT_name        : (strp) (offset: 0x3261): ndim
+    <84d>   DW_AT_name        : (strp) (offset: 0x3243): ndim
     <851>   DW_AT_decl_file   : (data1) 10
     <852>   DW_AT_decl_line   : (data1) 63
     <853>   DW_AT_decl_column : (data1) 9
     <854>   DW_AT_type        : (ref4) <0x5f>, int
     <858>   DW_AT_data_member_location: (data1) 36
  <2><859>: Abbrev Number: 11 (DW_TAG_member)
-    <85a>   DW_AT_name        : (strp) (offset: 0x2a17): format
+    <85a>   DW_AT_name        : (strp) (offset: 0x2954): format
     <85e>   DW_AT_decl_file   : (data1) 10
     <85f>   DW_AT_decl_line   : (data1) 64
     <860>   DW_AT_decl_column : (data1) 11
     <861>   DW_AT_type        : (ref4) <0x85>, char
     <865>   DW_AT_data_member_location: (data1) 40
  <2><866>: Abbrev Number: 11 (DW_TAG_member)
-    <867>   DW_AT_name        : (strp) (offset: 0x31e8): shape
+    <867>   DW_AT_name        : (strp) (offset: 0x31ca): shape
     <86b>   DW_AT_decl_file   : (data1) 10
     <86c>   DW_AT_decl_line   : (data1) 65
     <86d>   DW_AT_decl_column : (data1) 17
     <86e>   DW_AT_type        : (ref4) <0x89b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <872>   DW_AT_data_member_location: (data1) 48
  <2><873>: Abbrev Number: 11 (DW_TAG_member)
-    <874>   DW_AT_name        : (strp) (offset: 0x3851): strides
+    <874>   DW_AT_name        : (strp) (offset: 0x37a3): strides
     <878>   DW_AT_decl_file   : (data1) 10
     <879>   DW_AT_decl_line   : (data1) 66
     <87a>   DW_AT_decl_column : (data1) 17
     <87b>   DW_AT_type        : (ref4) <0x89b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <87f>   DW_AT_data_member_location: (data1) 56
  <2><880>: Abbrev Number: 11 (DW_TAG_member)
-    <881>   DW_AT_name        : (strp) (offset: 0x25a5): suboffsets
+    <881>   DW_AT_name        : (strp) (offset: 0x24bf): suboffsets
     <885>   DW_AT_decl_file   : (data1) 10
     <886>   DW_AT_decl_line   : (data1) 67
     <887>   DW_AT_decl_column : (data1) 17
     <888>   DW_AT_type        : (ref4) <0x89b>, Py_ssize_t, ssize_t, __ssize_t, long int
     <88c>   DW_AT_data_member_location: (data1) 64
  <2><88d>: Abbrev Number: 11 (DW_TAG_member)
-    <88e>   DW_AT_name        : (strp) (offset: 0x3c9d): internal
+    <88e>   DW_AT_name        : (strp) (offset: 0x3c02): internal
     <892>   DW_AT_decl_file   : (data1) 10
     <893>   DW_AT_decl_line   : (data1) 68
     <894>   DW_AT_decl_column : (data1) 11
     <895>   DW_AT_type        : (ref4) <0x77>
     <899>   DW_AT_data_member_location: (data1) 72
  <2><89a>: Abbrev Number: 0
  <1><89b>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <89c>   DW_AT_byte_size   : (data1) 8
     <89d>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
  <1><8a1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8a2>   DW_AT_name        : (strp) (offset: 0x4382): Py_buffer
+    <8a2>   DW_AT_name        : (strp) (offset: 0x42db): Py_buffer
     <8a6>   DW_AT_decl_file   : (data1) 10
     <8a7>   DW_AT_decl_line   : (data1) 69
     <8a8>   DW_AT_decl_column : (data1) 3
     <8a9>   DW_AT_type        : (ref4) <0x7fe>, bufferinfo
  <1><8ad>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8ae>   DW_AT_name        : (strp) (offset: 0x3390): getbufferproc
+    <8ae>   DW_AT_name        : (strp) (offset: 0x33a9): getbufferproc
     <8b2>   DW_AT_decl_file   : (data1) 10
     <8b3>   DW_AT_decl_line   : (data1) 71
     <8b4>   DW_AT_decl_column : (data1) 15
     <8b5>   DW_AT_type        : (ref4) <0x8b9>, int
  <1><8b9>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <8ba>   DW_AT_byte_size   : (data1) 8
     <8bb>   DW_AT_type        : (ref4) <0x8bf>, int
@@ -1136,15 +1136,15 @@
  <2><8d2>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <8d3>   DW_AT_type        : (ref4) <0x5f>, int
  <2><8d7>: Abbrev Number: 0
  <1><8d8>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <8d9>   DW_AT_byte_size   : (data1) 8
     <8da>   DW_AT_type        : (ref4) <0x8a1>, Py_buffer, bufferinfo
  <1><8de>: Abbrev Number: 2 (DW_TAG_typedef)
-    <8df>   DW_AT_name        : (strp) (offset: 0x3a85): releasebufferproc
+    <8df>   DW_AT_name        : (strp) (offset: 0x39c9): releasebufferproc
     <8e3>   DW_AT_decl_file   : (data1) 10
     <8e4>   DW_AT_decl_line   : (data1) 72
     <8e5>   DW_AT_decl_column : (data1) 16
     <8e6>   DW_AT_type        : (ref4) <0x8ea>
  <1><8ea>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <8eb>   DW_AT_byte_size   : (data1) 8
     <8ec>   DW_AT_type        : (ref4) <0x8f0>
@@ -1153,15 +1153,15 @@
     <8f1>   DW_AT_sibling     : (ref4) <0x900>
  <2><8f5>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <8f6>   DW_AT_type        : (ref4) <0x4c0>, PyObject, _object
  <2><8fa>: Abbrev Number: 18 (DW_TAG_formal_parameter)
     <8fb>   DW_AT_type        : (ref4) <0x8d8>, Py_buffer, bufferinfo
  <2><8ff>: Abbrev Number: 0
  <1><900>: Abbrev Number: 2 (DW_TAG_typedef)
-    <901>   DW_AT_name        : (strp) (offset: 0x16b4): vectorcallfunc
+    <901>   DW_AT_name        : (strp) (offset: 0x1637): vectorcallfunc
     <905>   DW_AT_decl_file   : (data1) 10
     <906>   DW_AT_decl_line   : (data1) 74
     <907>   DW_AT_decl_column : (data1) 21
     <908>   DW_AT_type        : (ref4) <0x90c>, PyObject, _object
  <1><90c>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <90d>   DW_AT_byte_size   : (data1) 8
     <90e>   DW_AT_type        : (ref4) <0x912>, PyObject, _object
@@ -1184,446 +1184,446 @@
  <1><936>: Abbrev Number: 23 (DW_TAG_structure_type)
     <937>   DW_AT_byte_size   : (data2) 288
     <939>   DW_AT_decl_file   : (data1) 10
     <93a>   DW_AT_decl_line   : (data1) 111
     <93b>   DW_AT_decl_column : (data1) 9
     <93c>   DW_AT_sibling     : (ref4) <0xb19>
  <2><940>: Abbrev Number: 11 (DW_TAG_member)
-    <941>   DW_AT_name        : (strp) (offset: 0x159): nb_add
+    <941>   DW_AT_name        : (strp) (offset: 0x18f): nb_add
     <945>   DW_AT_decl_file   : (data1) 10
     <946>   DW_AT_decl_line   : (data1) 116
     <947>   DW_AT_decl_column : (data1) 16
     <948>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <94c>   DW_AT_data_member_location: (data1) 0
  <2><94d>: Abbrev Number: 11 (DW_TAG_member)
-    <94e>   DW_AT_name        : (strp) (offset: 0x14da): nb_subtract
+    <94e>   DW_AT_name        : (strp) (offset: 0x14ce): nb_subtract
     <952>   DW_AT_decl_file   : (data1) 10
     <953>   DW_AT_decl_line   : (data1) 117
     <954>   DW_AT_decl_column : (data1) 16
     <955>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <959>   DW_AT_data_member_location: (data1) 8
  <2><95a>: Abbrev Number: 11 (DW_TAG_member)
-    <95b>   DW_AT_name        : (strp) (offset: 0x36a3): nb_multiply
+    <95b>   DW_AT_name        : (strp) (offset: 0x361e): nb_multiply
     <95f>   DW_AT_decl_file   : (data1) 10
     <960>   DW_AT_decl_line   : (data1) 118
     <961>   DW_AT_decl_column : (data1) 16
     <962>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <966>   DW_AT_data_member_location: (data1) 16
  <2><967>: Abbrev Number: 11 (DW_TAG_member)
-    <968>   DW_AT_name        : (strp) (offset: 0x915): nb_remainder
+    <968>   DW_AT_name        : (strp) (offset: 0x912): nb_remainder
     <96c>   DW_AT_decl_file   : (data1) 10
     <96d>   DW_AT_decl_line   : (data1) 119
     <96e>   DW_AT_decl_column : (data1) 16
     <96f>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <973>   DW_AT_data_member_location: (data1) 24
  <2><974>: Abbrev Number: 11 (DW_TAG_member)
-    <975>   DW_AT_name        : (strp) (offset: 0x44fc): nb_divmod
+    <975>   DW_AT_name        : (strp) (offset: 0x43d0): nb_divmod
     <979>   DW_AT_decl_file   : (data1) 10
     <97a>   DW_AT_decl_line   : (data1) 120
     <97b>   DW_AT_decl_column : (data1) 16
     <97c>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <980>   DW_AT_data_member_location: (data1) 32
  <2><981>: Abbrev Number: 11 (DW_TAG_member)
-    <982>   DW_AT_name        : (strp) (offset: 0x2b8): nb_power
+    <982>   DW_AT_name        : (strp) (offset: 0x2ee): nb_power
     <986>   DW_AT_decl_file   : (data1) 10
     <987>   DW_AT_decl_line   : (data1) 121
     <988>   DW_AT_decl_column : (data1) 17
     <989>   DW_AT_type        : (ref4) <0x4f1>, ternaryfunc, PyObject, _object
     <98d>   DW_AT_data_member_location: (data1) 40
  <2><98e>: Abbrev Number: 11 (DW_TAG_member)
-    <98f>   DW_AT_name        : (strp) (offset: 0x1d68): nb_negative
+    <98f>   DW_AT_name        : (strp) (offset: 0x1cb6): nb_negative
     <993>   DW_AT_decl_file   : (data1) 10
     <994>   DW_AT_decl_line   : (data1) 122
     <995>   DW_AT_decl_column : (data1) 15
     <996>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <99a>   DW_AT_data_member_location: (data1) 48
  <2><99b>: Abbrev Number: 11 (DW_TAG_member)
-    <99c>   DW_AT_name        : (strp) (offset: 0x3eba): nb_positive
+    <99c>   DW_AT_name        : (strp) (offset: 0x3e1f): nb_positive
     <9a0>   DW_AT_decl_file   : (data1) 10
     <9a1>   DW_AT_decl_line   : (data1) 123
     <9a2>   DW_AT_decl_column : (data1) 15
     <9a3>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <9a7>   DW_AT_data_member_location: (data1) 56
  <2><9a8>: Abbrev Number: 11 (DW_TAG_member)
-    <9a9>   DW_AT_name        : (strp) (offset: 0x3c29): nb_absolute
+    <9a9>   DW_AT_name        : (strp) (offset: 0x3b4e): nb_absolute
     <9ad>   DW_AT_decl_file   : (data1) 10
     <9ae>   DW_AT_decl_line   : (data1) 124
     <9af>   DW_AT_decl_column : (data1) 15
     <9b0>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <9b4>   DW_AT_data_member_location: (data1) 64
  <2><9b5>: Abbrev Number: 11 (DW_TAG_member)
-    <9b6>   DW_AT_name        : (strp) (offset: 0x1325): nb_bool
+    <9b6>   DW_AT_name        : (strp) (offset: 0x133d): nb_bool
     <9ba>   DW_AT_decl_file   : (data1) 10
     <9bb>   DW_AT_decl_line   : (data1) 125
     <9bc>   DW_AT_decl_column : (data1) 13
     <9bd>   DW_AT_type        : (ref4) <0x51c>, inquiry, int
     <9c1>   DW_AT_data_member_location: (data1) 72
  <2><9c2>: Abbrev Number: 11 (DW_TAG_member)
-    <9c3>   DW_AT_name        : (strp) (offset: 0x2bea): nb_invert
+    <9c3>   DW_AT_name        : (strp) (offset: 0x2b6e): nb_invert
     <9c7>   DW_AT_decl_file   : (data1) 10
     <9c8>   DW_AT_decl_line   : (data1) 126
     <9c9>   DW_AT_decl_column : (data1) 15
     <9ca>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <9ce>   DW_AT_data_member_location: (data1) 80
  <2><9cf>: Abbrev Number: 11 (DW_TAG_member)
-    <9d0>   DW_AT_name        : (strp) (offset: 0x250): nb_lshift
+    <9d0>   DW_AT_name        : (strp) (offset: 0x286): nb_lshift
     <9d4>   DW_AT_decl_file   : (data1) 10
     <9d5>   DW_AT_decl_line   : (data1) 127
     <9d6>   DW_AT_decl_column : (data1) 16
     <9d7>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <9db>   DW_AT_data_member_location: (data1) 88
  <2><9dc>: Abbrev Number: 11 (DW_TAG_member)
-    <9dd>   DW_AT_name        : (strp) (offset: 0x38ff): nb_rshift
+    <9dd>   DW_AT_name        : (strp) (offset: 0x3827): nb_rshift
     <9e1>   DW_AT_decl_file   : (data1) 10
     <9e2>   DW_AT_decl_line   : (data1) 128
     <9e3>   DW_AT_decl_column : (data1) 16
     <9e4>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <9e8>   DW_AT_data_member_location: (data1) 96
  <2><9e9>: Abbrev Number: 11 (DW_TAG_member)
-    <9ea>   DW_AT_name        : (strp) (offset: 0xc8e): nb_and
+    <9ea>   DW_AT_name        : (strp) (offset: 0xbf7): nb_and
     <9ee>   DW_AT_decl_file   : (data1) 10
     <9ef>   DW_AT_decl_line   : (data1) 129
     <9f0>   DW_AT_decl_column : (data1) 16
     <9f1>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <9f5>   DW_AT_data_member_location: (data1) 104
  <2><9f6>: Abbrev Number: 11 (DW_TAG_member)
-    <9f7>   DW_AT_name        : (strp) (offset: 0x1cfe): nb_xor
+    <9f7>   DW_AT_name        : (strp) (offset: 0x1c4c): nb_xor
     <9fb>   DW_AT_decl_file   : (data1) 10
     <9fc>   DW_AT_decl_line   : (data1) 130
     <9fd>   DW_AT_decl_column : (data1) 16
     <9fe>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a02>   DW_AT_data_member_location: (data1) 112
  <2><a03>: Abbrev Number: 11 (DW_TAG_member)
-    <a04>   DW_AT_name        : (strp) (offset: 0x29d5): nb_or
+    <a04>   DW_AT_name        : (strp) (offset: 0x2912): nb_or
     <a08>   DW_AT_decl_file   : (data1) 10
     <a09>   DW_AT_decl_line   : (data1) 131
     <a0a>   DW_AT_decl_column : (data1) 16
     <a0b>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a0f>   DW_AT_data_member_location: (data1) 120
  <2><a10>: Abbrev Number: 11 (DW_TAG_member)
-    <a11>   DW_AT_name        : (strp) (offset: 0x4325): nb_int
+    <a11>   DW_AT_name        : (strp) (offset: 0x427e): nb_int
     <a15>   DW_AT_decl_file   : (data1) 10
     <a16>   DW_AT_decl_line   : (data1) 132
     <a17>   DW_AT_decl_column : (data1) 15
     <a18>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <a1c>   DW_AT_data_member_location: (data1) 128
  <2><a1d>: Abbrev Number: 11 (DW_TAG_member)
-    <a1e>   DW_AT_name        : (strp) (offset: 0x181c): nb_reserved
+    <a1e>   DW_AT_name        : (strp) (offset: 0x17d0): nb_reserved
     <a22>   DW_AT_decl_file   : (data1) 10
     <a23>   DW_AT_decl_line   : (data1) 133
     <a24>   DW_AT_decl_column : (data1) 11
     <a25>   DW_AT_type        : (ref4) <0x77>
     <a29>   DW_AT_data_member_location: (data1) 136
  <2><a2a>: Abbrev Number: 11 (DW_TAG_member)
-    <a2b>   DW_AT_name        : (strp) (offset: 0x2ae5): nb_float
+    <a2b>   DW_AT_name        : (strp) (offset: 0x29e0): nb_float
     <a2f>   DW_AT_decl_file   : (data1) 10
     <a30>   DW_AT_decl_line   : (data1) 134
     <a31>   DW_AT_decl_column : (data1) 15
     <a32>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <a36>   DW_AT_data_member_location: (data1) 144
  <2><a37>: Abbrev Number: 11 (DW_TAG_member)
-    <a38>   DW_AT_name        : (strp) (offset: 0x180d): nb_inplace_add
+    <a38>   DW_AT_name        : (strp) (offset: 0x17c1): nb_inplace_add
     <a3c>   DW_AT_decl_file   : (data1) 10
     <a3d>   DW_AT_decl_line   : (data1) 136
     <a3e>   DW_AT_decl_column : (data1) 16
     <a3f>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a43>   DW_AT_data_member_location: (data1) 152
  <2><a44>: Abbrev Number: 11 (DW_TAG_member)
-    <a45>   DW_AT_name        : (strp) (offset: 0x442c): nb_inplace_subtract
+    <a45>   DW_AT_name        : (strp) (offset: 0x4385): nb_inplace_subtract
     <a49>   DW_AT_decl_file   : (data1) 10
     <a4a>   DW_AT_decl_line   : (data1) 137
     <a4b>   DW_AT_decl_column : (data1) 16
     <a4c>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a50>   DW_AT_data_member_location: (data1) 160
  <2><a51>: Abbrev Number: 11 (DW_TAG_member)
-    <a52>   DW_AT_name        : (strp) (offset: 0x3a71): nb_inplace_multiply
+    <a52>   DW_AT_name        : (strp) (offset: 0x39b5): nb_inplace_multiply
     <a56>   DW_AT_decl_file   : (data1) 10
     <a57>   DW_AT_decl_line   : (data1) 138
     <a58>   DW_AT_decl_column : (data1) 16
     <a59>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a5d>   DW_AT_data_member_location: (data1) 168
  <2><a5e>: Abbrev Number: 11 (DW_TAG_member)
-    <a5f>   DW_AT_name        : (strp) (offset: 0x3adc): nb_inplace_remainder
+    <a5f>   DW_AT_name        : (strp) (offset: 0x3a10): nb_inplace_remainder
     <a63>   DW_AT_decl_file   : (data1) 10
     <a64>   DW_AT_decl_line   : (data1) 139
     <a65>   DW_AT_decl_column : (data1) 16
     <a66>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a6a>   DW_AT_data_member_location: (data1) 176
  <2><a6b>: Abbrev Number: 11 (DW_TAG_member)
-    <a6c>   DW_AT_name        : (strp) (offset: 0x3633): nb_inplace_power
+    <a6c>   DW_AT_name        : (strp) (offset: 0x35a6): nb_inplace_power
     <a70>   DW_AT_decl_file   : (data1) 10
     <a71>   DW_AT_decl_line   : (data1) 140
     <a72>   DW_AT_decl_column : (data1) 17
     <a73>   DW_AT_type        : (ref4) <0x4f1>, ternaryfunc, PyObject, _object
     <a77>   DW_AT_data_member_location: (data1) 184
  <2><a78>: Abbrev Number: 11 (DW_TAG_member)
-    <a79>   DW_AT_name        : (strp) (offset: 0x5f4): nb_inplace_lshift
+    <a79>   DW_AT_name        : (strp) (offset: 0x6fa): nb_inplace_lshift
     <a7d>   DW_AT_decl_file   : (data1) 10
     <a7e>   DW_AT_decl_line   : (data1) 141
     <a7f>   DW_AT_decl_column : (data1) 16
     <a80>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a84>   DW_AT_data_member_location: (data1) 192
  <2><a85>: Abbrev Number: 11 (DW_TAG_member)
-    <a86>   DW_AT_name        : (strp) (offset: 0x3e55): nb_inplace_rshift
+    <a86>   DW_AT_name        : (strp) (offset: 0x3dba): nb_inplace_rshift
     <a8a>   DW_AT_decl_file   : (data1) 10
     <a8b>   DW_AT_decl_line   : (data1) 142
     <a8c>   DW_AT_decl_column : (data1) 16
     <a8d>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a91>   DW_AT_data_member_location: (data1) 200
  <2><a92>: Abbrev Number: 11 (DW_TAG_member)
-    <a93>   DW_AT_name        : (strp) (offset: 0x248d): nb_inplace_and
+    <a93>   DW_AT_name        : (strp) (offset: 0x23e1): nb_inplace_and
     <a97>   DW_AT_decl_file   : (data1) 10
     <a98>   DW_AT_decl_line   : (data1) 143
     <a99>   DW_AT_decl_column : (data1) 16
     <a9a>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <a9e>   DW_AT_data_member_location: (data1) 208
  <2><a9f>: Abbrev Number: 11 (DW_TAG_member)
-    <aa0>   DW_AT_name        : (strp) (offset: 0x35fe): nb_inplace_xor
+    <aa0>   DW_AT_name        : (strp) (offset: 0x3571): nb_inplace_xor
     <aa4>   DW_AT_decl_file   : (data1) 10
     <aa5>   DW_AT_decl_line   : (data1) 144
     <aa6>   DW_AT_decl_column : (data1) 16
     <aa7>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <aab>   DW_AT_data_member_location: (data1) 216
  <2><aac>: Abbrev Number: 11 (DW_TAG_member)
-    <aad>   DW_AT_name        : (strp) (offset: 0x3d36): nb_inplace_or
+    <aad>   DW_AT_name        : (strp) (offset: 0x3c9b): nb_inplace_or
     <ab1>   DW_AT_decl_file   : (data1) 10
     <ab2>   DW_AT_decl_line   : (data1) 145
     <ab3>   DW_AT_decl_column : (data1) 16
     <ab4>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <ab8>   DW_AT_data_member_location: (data1) 224
  <2><ab9>: Abbrev Number: 11 (DW_TAG_member)
-    <aba>   DW_AT_name        : (strp) (offset: 0x5d5): nb_floor_divide
+    <aba>   DW_AT_name        : (strp) (offset: 0x6db): nb_floor_divide
     <abe>   DW_AT_decl_file   : (data1) 10
     <abf>   DW_AT_decl_line   : (data1) 147
     <ac0>   DW_AT_decl_column : (data1) 16
     <ac1>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <ac5>   DW_AT_data_member_location: (data1) 232
  <2><ac6>: Abbrev Number: 11 (DW_TAG_member)
-    <ac7>   DW_AT_name        : (strp) (offset: 0x36cf): nb_true_divide
+    <ac7>   DW_AT_name        : (strp) (offset: 0x364a): nb_true_divide
     <acb>   DW_AT_decl_file   : (data1) 10
     <acc>   DW_AT_decl_line   : (data1) 148
     <acd>   DW_AT_decl_column : (data1) 16
     <ace>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <ad2>   DW_AT_data_member_location: (data1) 240
  <2><ad3>: Abbrev Number: 11 (DW_TAG_member)
-    <ad4>   DW_AT_name        : (strp) (offset: 0x3811): nb_inplace_floor_divide
+    <ad4>   DW_AT_name        : (strp) (offset: 0x3763): nb_inplace_floor_divide
     <ad8>   DW_AT_decl_file   : (data1) 10
     <ad9>   DW_AT_decl_line   : (data1) 149
     <ada>   DW_AT_decl_column : (data1) 16
     <adb>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <adf>   DW_AT_data_member_location: (data1) 248
  <2><ae0>: Abbrev Number: 14 (DW_TAG_member)
-    <ae1>   DW_AT_name        : (strp) (offset: 0x2119): nb_inplace_true_divide
+    <ae1>   DW_AT_name        : (strp) (offset: 0x20d2): nb_inplace_true_divide
     <ae5>   DW_AT_decl_file   : (data1) 10
     <ae6>   DW_AT_decl_line   : (data1) 150
     <ae7>   DW_AT_decl_column : (data1) 16
     <ae8>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <aec>   DW_AT_data_member_location: (data2) 256
  <2><aee>: Abbrev Number: 14 (DW_TAG_member)
-    <aef>   DW_AT_name        : (strp) (offset: 0x81e): nb_index
+    <aef>   DW_AT_name        : (strp) (offset: 0x862): nb_index
     <af3>   DW_AT_decl_file   : (data1) 10
     <af4>   DW_AT_decl_line   : (data1) 152
     <af5>   DW_AT_decl_column : (data1) 15
     <af6>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <afa>   DW_AT_data_member_location: (data2) 264
  <2><afc>: Abbrev Number: 14 (DW_TAG_member)
-    <afd>   DW_AT_name        : (strp) (offset: 0x23d): nb_matrix_multiply
+    <afd>   DW_AT_name        : (strp) (offset: 0x273): nb_matrix_multiply
     <b01>   DW_AT_decl_file   : (data1) 10
     <b02>   DW_AT_decl_line   : (data1) 154
     <b03>   DW_AT_decl_column : (data1) 16
     <b04>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <b08>   DW_AT_data_member_location: (data2) 272
  <2><b0a>: Abbrev Number: 14 (DW_TAG_member)
-    <b0b>   DW_AT_name        : (strp) (offset: 0x4404): nb_inplace_matrix_multiply
+    <b0b>   DW_AT_name        : (strp) (offset: 0x435d): nb_inplace_matrix_multiply
     <b0f>   DW_AT_decl_file   : (data1) 10
     <b10>   DW_AT_decl_line   : (data1) 155
     <b11>   DW_AT_decl_column : (data1) 16
     <b12>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <b16>   DW_AT_data_member_location: (data2) 280
  <2><b18>: Abbrev Number: 0
  <1><b19>: Abbrev Number: 2 (DW_TAG_typedef)
-    <b1a>   DW_AT_name        : (strp) (offset: 0x1158): PyNumberMethods
+    <b1a>   DW_AT_name        : (strp) (offset: 0x1137): PyNumberMethods
     <b1e>   DW_AT_decl_file   : (data1) 10
     <b1f>   DW_AT_decl_line   : (data1) 156
     <b20>   DW_AT_decl_column : (data1) 3
     <b21>   DW_AT_type        : (ref4) <0x936>
  <1><b25>: Abbrev Number: 16 (DW_TAG_structure_type)
     <b26>   DW_AT_byte_size   : (data1) 80
     <b27>   DW_AT_decl_file   : (data1) 10
     <b28>   DW_AT_decl_line   : (data1) 158
     <b29>   DW_AT_decl_column : (data1) 9
     <b2a>   DW_AT_sibling     : (ref4) <0xbb1>
  <2><b2e>: Abbrev Number: 11 (DW_TAG_member)
-    <b2f>   DW_AT_name        : (strp) (offset: 0x3786): sq_length
+    <b2f>   DW_AT_name        : (strp) (offset: 0x36d8): sq_length
     <b33>   DW_AT_decl_file   : (data1) 10
     <b34>   DW_AT_decl_line   : (data1) 159
     <b35>   DW_AT_decl_column : (data1) 13
     <b36>   DW_AT_type        : (ref4) <0x53d>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <b3a>   DW_AT_data_member_location: (data1) 0
  <2><b3b>: Abbrev Number: 11 (DW_TAG_member)
-    <b3c>   DW_AT_name        : (strp) (offset: 0x3c0): sq_concat
+    <b3c>   DW_AT_name        : (strp) (offset: 0x3f6): sq_concat
     <b40>   DW_AT_decl_file   : (data1) 10
     <b41>   DW_AT_decl_line   : (data1) 160
     <b42>   DW_AT_decl_column : (data1) 16
     <b43>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <b47>   DW_AT_data_member_location: (data1) 8
  <2><b48>: Abbrev Number: 11 (DW_TAG_member)
-    <b49>   DW_AT_name        : (strp) (offset: 0x330): sq_repeat
+    <b49>   DW_AT_name        : (strp) (offset: 0x366): sq_repeat
     <b4d>   DW_AT_decl_file   : (data1) 10
     <b4e>   DW_AT_decl_line   : (data1) 161
     <b4f>   DW_AT_decl_column : (data1) 18
     <b50>   DW_AT_type        : (ref4) <0x55e>, ssizeargfunc, PyObject, _object
     <b54>   DW_AT_data_member_location: (data1) 16
  <2><b55>: Abbrev Number: 11 (DW_TAG_member)
-    <b56>   DW_AT_name        : (strp) (offset: 0x135): sq_item
+    <b56>   DW_AT_name        : (strp) (offset: 0x16b): sq_item
     <b5a>   DW_AT_decl_file   : (data1) 10
     <b5b>   DW_AT_decl_line   : (data1) 162
     <b5c>   DW_AT_decl_column : (data1) 18
     <b5d>   DW_AT_type        : (ref4) <0x55e>, ssizeargfunc, PyObject, _object
     <b61>   DW_AT_data_member_location: (data1) 24
  <2><b62>: Abbrev Number: 11 (DW_TAG_member)
-    <b63>   DW_AT_name        : (strp) (offset: 0xa68): was_sq_slice
+    <b63>   DW_AT_name        : (strp) (offset: 0xa5a): was_sq_slice
     <b67>   DW_AT_decl_file   : (data1) 10
     <b68>   DW_AT_decl_line   : (data1) 163
     <b69>   DW_AT_decl_column : (data1) 11
     <b6a>   DW_AT_type        : (ref4) <0x77>
     <b6e>   DW_AT_data_member_location: (data1) 32
  <2><b6f>: Abbrev Number: 11 (DW_TAG_member)
-    <b70>   DW_AT_name        : (strp) (offset: 0x1bb): sq_ass_item
+    <b70>   DW_AT_name        : (strp) (offset: 0x1f1): sq_ass_item
     <b74>   DW_AT_decl_file   : (data1) 10
     <b75>   DW_AT_decl_line   : (data1) 164
     <b76>   DW_AT_decl_column : (data1) 21
     <b77>   DW_AT_type        : (ref4) <0x584>, ssizeobjargproc, int
     <b7b>   DW_AT_data_member_location: (data1) 40
  <2><b7c>: Abbrev Number: 11 (DW_TAG_member)
-    <b7d>   DW_AT_name        : (strp) (offset: 0xe3b): was_sq_ass_slice
+    <b7d>   DW_AT_name        : (strp) (offset: 0xde2): was_sq_ass_slice
     <b81>   DW_AT_decl_file   : (data1) 10
     <b82>   DW_AT_decl_line   : (data1) 165
     <b83>   DW_AT_decl_column : (data1) 11
     <b84>   DW_AT_type        : (ref4) <0x77>
     <b88>   DW_AT_data_member_location: (data1) 48
  <2><b89>: Abbrev Number: 11 (DW_TAG_member)
-    <b8a>   DW_AT_name        : (strp) (offset: 0xf4c): sq_contains
+    <b8a>   DW_AT_name        : (strp) (offset: 0xf25): sq_contains
     <b8e>   DW_AT_decl_file   : (data1) 10
     <b8f>   DW_AT_decl_line   : (data1) 166
     <b90>   DW_AT_decl_column : (data1) 16
     <b91>   DW_AT_type        : (ref4) <0x5da>, objobjproc, int
     <b95>   DW_AT_data_member_location: (data1) 56
  <2><b96>: Abbrev Number: 11 (DW_TAG_member)
-    <b97>   DW_AT_name        : (strp) (offset: 0x286): sq_inplace_concat
+    <b97>   DW_AT_name        : (strp) (offset: 0x2bc): sq_inplace_concat
     <b9b>   DW_AT_decl_file   : (data1) 10
     <b9c>   DW_AT_decl_line   : (data1) 168
     <b9d>   DW_AT_decl_column : (data1) 16
     <b9e>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <ba2>   DW_AT_data_member_location: (data1) 64
  <2><ba3>: Abbrev Number: 11 (DW_TAG_member)
-    <ba4>   DW_AT_name        : (strp) (offset: 0x21f): sq_inplace_repeat
+    <ba4>   DW_AT_name        : (strp) (offset: 0x255): sq_inplace_repeat
     <ba8>   DW_AT_decl_file   : (data1) 10
     <ba9>   DW_AT_decl_line   : (data1) 169
     <baa>   DW_AT_decl_column : (data1) 18
     <bab>   DW_AT_type        : (ref4) <0x55e>, ssizeargfunc, PyObject, _object
     <baf>   DW_AT_data_member_location: (data1) 72
  <2><bb0>: Abbrev Number: 0
  <1><bb1>: Abbrev Number: 2 (DW_TAG_typedef)
-    <bb2>   DW_AT_name        : (strp) (offset: 0x267f): PySequenceMethods
+    <bb2>   DW_AT_name        : (strp) (offset: 0x258a): PySequenceMethods
     <bb6>   DW_AT_decl_file   : (data1) 10
     <bb7>   DW_AT_decl_line   : (data1) 170
     <bb8>   DW_AT_decl_column : (data1) 3
     <bb9>   DW_AT_type        : (ref4) <0xb25>
  <1><bbd>: Abbrev Number: 16 (DW_TAG_structure_type)
     <bbe>   DW_AT_byte_size   : (data1) 24
     <bbf>   DW_AT_decl_file   : (data1) 10
     <bc0>   DW_AT_decl_line   : (data1) 172
     <bc1>   DW_AT_decl_column : (data1) 9
     <bc2>   DW_AT_sibling     : (ref4) <0xbee>
  <2><bc6>: Abbrev Number: 11 (DW_TAG_member)
-    <bc7>   DW_AT_name        : (strp) (offset: 0x351d): mp_length
+    <bc7>   DW_AT_name        : (strp) (offset: 0x34b7): mp_length
     <bcb>   DW_AT_decl_file   : (data1) 10
     <bcc>   DW_AT_decl_line   : (data1) 173
     <bcd>   DW_AT_decl_column : (data1) 13
     <bce>   DW_AT_type        : (ref4) <0x53d>, lenfunc, Py_ssize_t, ssize_t, __ssize_t, long int
     <bd2>   DW_AT_data_member_location: (data1) 0
  <2><bd3>: Abbrev Number: 11 (DW_TAG_member)
-    <bd4>   DW_AT_name        : (strp) (offset: 0x120f): mp_subscript
+    <bd4>   DW_AT_name        : (strp) (offset: 0x1227): mp_subscript
     <bd8>   DW_AT_decl_file   : (data1) 10
     <bd9>   DW_AT_decl_line   : (data1) 174
     <bda>   DW_AT_decl_column : (data1) 16
     <bdb>   DW_AT_type        : (ref4) <0x4cb>, binaryfunc, PyObject, _object
     <bdf>   DW_AT_data_member_location: (data1) 8
  <2><be0>: Abbrev Number: 11 (DW_TAG_member)
-    <be1>   DW_AT_name        : (strp) (offset: 0x10ad): mp_ass_subscript
+    <be1>   DW_AT_name        : (strp) (offset: 0x108c): mp_ass_subscript
     <be5>   DW_AT_decl_file   : (data1) 10
     <be6>   DW_AT_decl_line   : (data1) 175
     <be7>   DW_AT_decl_column : (data1) 19
     <be8>   DW_AT_type        : (ref4) <0x5af>, objobjargproc, int
     <bec>   DW_AT_data_member_location: (data1) 16
  <2><bed>: Abbrev Number: 0
  <1><bee>: Abbrev Number: 2 (DW_TAG_typedef)
-    <bef>   DW_AT_name        : (strp) (offset: 0x3f40): PyMappingMethods
+    <bef>   DW_AT_name        : (strp) (offset: 0x3ea5): PyMappingMethods
     <bf3>   DW_AT_decl_file   : (data1) 10
     <bf4>   DW_AT_decl_line   : (data1) 176
     <bf5>   DW_AT_decl_column : (data1) 3
     <bf6>   DW_AT_type        : (ref4) <0xbbd>
  <1><bfa>: Abbrev Number: 16 (DW_TAG_structure_type)
     <bfb>   DW_AT_byte_size   : (data1) 24
     <bfc>   DW_AT_decl_file   : (data1) 10
     <bfd>   DW_AT_decl_line   : (data1) 178
     <bfe>   DW_AT_decl_column : (data1) 9
     <bff>   DW_AT_sibling     : (ref4) <0xc2b>
  <2><c03>: Abbrev Number: 11 (DW_TAG_member)
-    <c04>   DW_AT_name        : (strp) (offset: 0x3482): am_await
+    <c04>   DW_AT_name        : (strp) (offset: 0x341c): am_await
     <c08>   DW_AT_decl_file   : (data1) 10
     <c09>   DW_AT_decl_line   : (data1) 179
     <c0a>   DW_AT_decl_column : (data1) 15
     <c0b>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <c0f>   DW_AT_data_member_location: (data1) 0
  <2><c10>: Abbrev Number: 11 (DW_TAG_member)
-    <c11>   DW_AT_name        : (strp) (offset: 0x3595): am_aiter
+    <c11>   DW_AT_name        : (strp) (offset: 0x354e): am_aiter
     <c15>   DW_AT_decl_file   : (data1) 10
     <c16>   DW_AT_decl_line   : (data1) 180
     <c17>   DW_AT_decl_column : (data1) 15
     <c18>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <c1c>   DW_AT_data_member_location: (data1) 8
  <2><c1d>: Abbrev Number: 11 (DW_TAG_member)
-    <c1e>   DW_AT_name        : (strp) (offset: 0x30c): am_anext
+    <c1e>   DW_AT_name        : (strp) (offset: 0x342): am_anext
     <c22>   DW_AT_decl_file   : (data1) 10
     <c23>   DW_AT_decl_line   : (data1) 181
     <c24>   DW_AT_decl_column : (data1) 15
     <c25>   DW_AT_type        : (ref4) <0x49f>, unaryfunc, PyObject, _object
     <c29>   DW_AT_data_member_location: (data1) 16
  <2><c2a>: Abbrev Number: 0
  <1><c2b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <c2c>   DW_AT_name        : (strp) (offset: 0x2d12): PyAsyncMethods
+    <c2c>   DW_AT_name        : (strp) (offset: 0x2c89): PyAsyncMethods
     <c30>   DW_AT_decl_file   : (data1) 10
     <c31>   DW_AT_decl_line   : (data1) 182
     <c32>   DW_AT_decl_column : (data1) 3
     <c33>   DW_AT_type        : (ref4) <0xbfa>
  <1><c37>: Abbrev Number: 16 (DW_TAG_structure_type)
     <c38>   DW_AT_byte_size   : (data1) 16
     <c39>   DW_AT_decl_file   : (data1) 10
     <c3a>   DW_AT_decl_line   : (data1) 184
     <c3b>   DW_AT_decl_column : (data1) 9
     <c3c>   DW_AT_sibling     : (ref4) <0xc5b>
  <2><c40>: Abbrev Number: 11 (DW_TAG_member)
-    <c41>   DW_AT_name        : (strp) (offset: 0x168e): bf_getbuffer
+    <c41>   DW_AT_name        : (strp) (offset: 0x1611): bf_getbuffer
     <c45>   DW_AT_decl_file   : (data1) 10
     <c46>   DW_AT_decl_line   : (data1) 185
     <c47>   DW_AT_decl_column : (data1) 20
     <c48>   DW_AT_type        : (ref4) <0x8ad>, getbufferproc, int
     <c4c>   DW_AT_data_member_location: (data1) 0
  <2><c4d>: Abbrev Number: 11 (DW_TAG_member)
-    <c4e>   DW_AT_name        : (strp) (offset: 0x39de): bf_releasebuffer
+    <c4e>   DW_AT_name        : (strp) (offset: 0x38cc): bf_releasebuffer
     <c52>   DW_AT_decl_file   : (data1) 10
     <c53>   DW_AT_decl_line   : (data1) 186
     <c54>   DW_AT_decl_column : (data1) 24
     <c55>   DW_AT_type        : (ref4) <0x8de>, releasebufferproc
     <c59>   DW_AT_data_member_location: (data1) 8
  <2><c5a>: Abbrev Number: 0
  <1><c5b>: Abbrev Number: 2 (DW_TAG_typedef)
-    <c5c>   DW_AT_name        : (strp) (offset: 0x201d): PyBufferProcs
+    <c5c>   DW_AT_name        : (strp) (offset: 0x1f98): PyBufferProcs
     <c60>   DW_AT_decl_file   : (data1) 10
     <c61>   DW_AT_decl_line   : (data1) 187
     <c62>   DW_AT_decl_column : (data1) 3
     <c63>   DW_AT_type        : (ref4) <0xc37>
  <1><c67>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c68>   DW_AT_byte_size   : (data1) 8
     <c69>   DW_AT_type        : (ref4) <0xc2b>, PyAsyncMethods
@@ -1636,82 +1636,82 @@
  <1><c79>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c7a>   DW_AT_byte_size   : (data1) 8
     <c7b>   DW_AT_type        : (ref4) <0xbee>, PyMappingMethods
  <1><c7f>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <c80>   DW_AT_byte_size   : (data1) 8
     <c81>   DW_AT_type        : (ref4) <0xc5b>, PyBufferProcs
  <1><c85>: Abbrev Number: 10 (DW_TAG_structure_type)
-    <c86>   DW_AT_name        : (strp) (offset: 0x1197): PyMethodDef
+    <c86>   DW_AT_name        : (strp) (offset: 0x1176): PyMethodDef
     <c8a>   DW_AT_byte_size   : (data1) 32
     <c8b>   DW_AT_decl_file   : (data1) 11
     <c8c>   DW_AT_decl_line   : (data1) 35
     <c8d>   DW_AT_decl_column : (data1) 8
     <c8e>   DW_AT_sibling     : (ref4) <0xcc7>
  <2><c92>: Abbrev Number: 11 (DW_TAG_member)
-    <c93>   DW_AT_name        : (strp) (offset: 0x2c4f): ml_name
+    <c93>   DW_AT_name        : (strp) (offset: 0x2b9c): ml_name
     <c97>   DW_AT_decl_file   : (data1) 11
     <c98>   DW_AT_decl_line   : (data1) 36
     <c99>   DW_AT_decl_column : (data1) 18
     <c9a>   DW_AT_type        : (ref4) <0x97>, char
     <c9e>   DW_AT_data_member_location: (data1) 0
  <2><c9f>: Abbrev Number: 11 (DW_TAG_member)
-    <ca0>   DW_AT_name        : (strp) (offset: 0x2db3): ml_meth
+    <ca0>   DW_AT_name        : (strp) (offset: 0x2d2a): ml_meth
     <ca4>   DW_AT_decl_file   : (data1) 11
     <ca5>   DW_AT_decl_line   : (data1) 37
     <ca6>   DW_AT_decl_column : (data1) 17
     <ca7>   DW_AT_type        : (ref4) <0x11c3>, PyCFunction, PyObject, _object
     <cab>   DW_AT_data_member_location: (data1) 8
  <2><cac>: Abbrev Number: 11 (DW_TAG_member)
-    <cad>   DW_AT_name        : (strp) (offset: 0x2067): ml_flags
+    <cad>   DW_AT_name        : (strp) (offset: 0x1fe2): ml_flags
     <cb1>   DW_AT_decl_file   : (data1) 11
     <cb2>   DW_AT_decl_line   : (data1) 38
     <cb3>   DW_AT_decl_column : (data1) 17
     <cb4>   DW_AT_type        : (ref4) <0x5f>, int
     <cb8>   DW_AT_data_member_location: (data1) 16
  <2><cb9>: Abbrev Number: 11 (DW_TAG_member)
-    <cba>   DW_AT_name        : (strp) (offset: 0x2bfd): ml_doc
+    <cba>   DW_AT_name        : (strp) (offset: 0x2b81): ml_doc
     <cbe>   DW_AT_decl_file   : (data1) 11
     <cbf>   DW_AT_decl_line   : (data1) 40
     <cc0>   DW_AT_decl_column : (data1) 18
     <cc1>   DW_AT_type        : (ref4) <0x97>, char
     <cc5>   DW_AT_data_member_location: (data1) 24
  <2><cc6>: Abbrev Number: 0
  <1><cc7>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <cc8>   DW_AT_byte_size   : (data1) 8
     <cc9>   DW_AT_type        : (ref4) <0xc85>, PyMethodDef
  <1><ccd>: Abbrev Number: 10 (DW_TAG_structure_type)
-    <cce>   DW_AT_name        : (strp) (offset: 0xa75): PyMemberDef
+    <cce>   DW_AT_name        : (strp) (offset: 0xa67): PyMemberDef
     <cd2>   DW_AT_byte_size   : (data1) 40
     <cd3>   DW_AT_decl_file   : (data1) 12
     <cd4>   DW_AT_decl_line   : (data1) 18
     <cd5>   DW_AT_decl_column : (data1) 16
     <cd6>   DW_AT_sibling     : (ref4) <0xd1c>
  <2><cda>: Abbrev Number: 11 (DW_TAG_member)
-    <cdb>   DW_AT_name        : (strp) (offset: 0x334f): name
+    <cdb>   DW_AT_name        : (strp) (offset: 0x3368): name
     <cdf>   DW_AT_decl_file   : (data1) 12
     <ce0>   DW_AT_decl_line   : (data1) 19
     <ce1>   DW_AT_decl_column : (data1) 17
     <ce2>   DW_AT_type        : (ref4) <0x97>, char
     <ce6>   DW_AT_data_member_location: (data1) 0
  <2><ce7>: Abbrev Number: 11 (DW_TAG_member)
-    <ce8>   DW_AT_name        : (strp) (offset: 0xafc): type
+    <ce8>   DW_AT_name        : (strp) (offset: 0xae3): type
     <cec>   DW_AT_decl_file   : (data1) 12
     <ced>   DW_AT_decl_line   : (data1) 20
     <cee>   DW_AT_decl_column : (data1) 9
     <cef>   DW_AT_type        : (ref4) <0x5f>, int
     <cf3>   DW_AT_data_member_location: (data1) 8
  <2><cf4>: Abbrev Number: 11 (DW_TAG_member)
-    <cf5>   DW_AT_name        : (strp) (offset: 0x2ba1): offset
+    <cf5>   DW_AT_name        : (strp) (offset: 0x2b0a): offset
     <cf9>   DW_AT_decl_file   : (data1) 12
     <cfa>   DW_AT_decl_line   : (data1) 21
     <cfb>   DW_AT_decl_column : (data1) 16
     <cfc>   DW_AT_type        : (ref4) <0x113>, Py_ssize_t, ssize_t, __ssize_t, long int
     <d00>   DW_AT_data_member_location: (data1) 16
  <2><d01>: Abbrev Number: 11 (DW_TAG_member)
-    <d02>   DW_AT_name        : (strp) (offset: 0x206a): flags
+    <d02>   DW_AT_name        : (strp) (offset: 0x1fe5): flags
     <d06>   DW_AT_decl_file   : (data1) 12
     <d07>   DW_AT_decl_line   : (data1) 22
     <d08>   DW_AT_decl_column : (data1) 9
     <d09>   DW_AT_type        : (ref4) <0x5f>, int
     <d0d>   DW_AT_data_member_location: (data1) 24
  <2><d0e>: Abbrev Number: 22 (DW_TAG_member)
     <d0f>   DW_AT_name        : (string) doc
@@ -1721,22 +1721,22 @@
     <d16>   DW_AT_type        : (ref4) <0x97>, char
     <d1a>   DW_AT_data_member_location: (data1) 32
  <2><d1b>: Abbrev Number: 0
  <1><d1c>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <d1d>   DW_AT_byte_size   : (data1) 8
     <d1e>   DW_AT_type        : (ref4) <0xccd>, PyMemberDef
  <1><d22>: Abbrev Number: 10 (DW_TAG_structure_type)
-    <d23>   DW_AT_name        : (strp) (offset: 0x407): PyGetSetDef
+    <d23>   DW_AT_name        : (strp) (offset: 0x4bc): PyGetSetDef
     <d27>   DW_AT_byte_size   : (data1) 40
     <d28>   DW_AT_decl_file   : (data1) 13
     <d29>   DW_AT_decl_line   : (data1) 11
     <d2a>   DW_AT_decl_column : (data1) 16
     <d2b>   DW_AT_sibling     : (ref4) <0xd71>
  <2><d2f>: Abbrev Number: 11 (DW_TAG_member)
-    <d30>   DW_AT_name        : (strp) (offset: 0x334f): name
+    <d30>   DW_AT_name        : (strp) (offset: 0x3368): name
     <d34>   DW_AT_decl_file   : (data1) 13
     <d35>   DW_AT_decl_line   : (data1) 12
     <d36>   DW_AT_decl_column : (data1) 17
     <d37>   DW_AT_type        : (ref4) <0x97>, char
     <d3b>   DW_AT_data_member_location: (data1) 0
  <2><d3c>: Abbrev Number: 22 (DW_TAG_member)
     <d3d>   DW_AT_name        : (string) get
@@ -1756,198 +1756,198 @@
     <d57>   DW_AT_name        : (string) doc
     <d5b>   DW_AT_decl_file   : (data1) 13
     <d5c>   DW_AT_decl_line   : (data1) 15
     <d5d>   DW_AT_decl_column : (data1) 17
     <d5e>   DW_AT_type        : (ref4) <0x97>, char
     <d62>   DW_AT_data_member_location: (data1) 24
  <2><d63>: Abbrev Number: 11 (DW_TAG_member)
-    <d64>   DW_AT_name        : (strp) (offset: 0x2cd1): closure
+    <d64>   DW_AT_name        : (strp) (offset: 0x2c2d): closure
     <d68>   DW_AT_decl_file   : (data1) 13
     <d69>   DW_AT_decl_line   : (data1) 16
     <d6a>   DW_AT_decl_column : (data1) 11
     <d6b>   DW_AT_type        : (ref4) <0x77>
     <d6f>   DW_AT_data_member_location: (data1) 32
  <2><d70>: Abbrev Number: 0
  <1><d71>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <d72>   DW_AT_byte_size   : (data1) 8
     <d73>   DW_AT_type        : (ref4) <0xd22>, PyGetSetDef
  <1><d77>: Abbrev Number: 7 (DW_TAG_pointer_type)
     <d78>   DW_AT_byte_size   : (data1) 8
     <d79>   DW_AT_type        : (ref4) <0x182>, _typeobject
  <1><d7d>: Abbrev Number: 24 (DW_TAG_structure_type)
-    <d7e>   DW_AT_name        : (strp) (offset: 0x2963): _heaptypeobject
+    <d7e>   DW_AT_name        : (strp) (offset: 0x28e7): _heaptypeobject
     <d82>   DW_AT_byte_size   : (data2) 880
     <d84>   DW_AT_decl_file   : (data1) 10
     <d85>   DW_AT_decl_line   : (data2) 277
     <d87>   DW_AT_decl_column : (data1) 16
     <d88>   DW_AT_sibling     : (ref4) <0xe31>
  <2><d8c>: Abbrev Number: 25 (DW_TAG_member)
-    <d8d>   DW_AT_name        : (strp) (offset: 0x292c): ht_type
+    <d8d>   DW_AT_name        : (strp) (offset: 0x28b0): ht_type
     <d91>   DW_AT_decl_file   : (data1) 10
     <d92>   DW_AT_decl_line   : (data2) 280
     <d94>   DW_AT_decl_column : (data1) 18
     <d95>   DW_AT_type        : (ref4) <0x171>, PyTypeObject, _typeobject
     <d99>   DW_AT_data_member_location: (data1) 0
  <2><d9a>: Abbrev Number: 15 (DW_TAG_member)
-    <d9b>   DW_AT_name        : (strp) (offset: 0x234): as_async
+    <d9b>   DW_AT_name        : (strp) (offset: 0x26a): as_async
     <d9f>   DW_AT_decl_file   : (data1) 10
     <da0>   DW_AT_decl_line   : (data2) 281
     <da2>   DW_AT_decl_column : (data1) 20
     <da3>   DW_AT_type        : (ref4) <0xc2b>, PyAsyncMethods
     <da7>   DW_AT_data_member_location: (data2) 408
  <2><da9>: Abbrev Number: 15 (DW_TAG_member)
-    <daa>   DW_AT_name        : (strp) (offset: 0x2cdc): as_number
+    <daa>   DW_AT_name        : (strp) (offset: 0x2c7f): as_number
     <dae>   DW_AT_decl_file   : (data1) 10
     <daf>   DW_AT_decl_line   : (data2) 282
     <db1>   DW_AT_decl_column : (data1) 21
     <db2>   DW_AT_type        : (ref4) <0xb19>, PyNumberMethods
     <db6>   DW_AT_data_member_location: (data2) 432
  <2><db8>: Abbrev Number: 15 (DW_TAG_member)
-    <db9>   DW_AT_name        : (strp) (offset: 0x14c1): as_mapping
+    <db9>   DW_AT_name        : (strp) (offset: 0x14b5): as_mapping
     <dbd>   DW_AT_decl_file   : (data1) 10
     <dbe>   DW_AT_decl_line   : (data2) 283
     <dc0>   DW_AT_decl_column : (data1) 22
     <dc1>   DW_AT_type        : (ref4) <0xbee>, PyMappingMethods
     <dc5>   DW_AT_data_member_location: (data2) 720
  <2><dc7>: Abbrev Number: 15 (DW_TAG_member)
-    <dc8>   DW_AT_name        : (strp) (offset: 0x2425): as_sequence
+    <dc8>   DW_AT_name        : (strp) (offset: 0x2379): as_sequence
     <dcc>   DW_AT_decl_file   : (data1) 10
     <dcd>   DW_AT_decl_line   : (data2) 284
     <dcf>   DW_AT_decl_column : (data1) 23
     <dd0>   DW_AT_type        : (ref4) <0xbb1>, PySequenceMethods
     <dd4>   DW_AT_data_member_location: (data2) 744
  <2><dd6>: Abbrev Number: 15 (DW_TAG_member)
-    <dd7>   DW_AT_name        : (strp) (offset: 0x244c): as_buffer
+    <dd7>   DW_AT_name        : (strp) (offset: 0x23a0): as_buffer
     <ddb>   DW_AT_decl_file   : (data1) 10
     <ddc>   DW_AT_decl_line   : (data2) 289
     <dde>   DW_AT_decl_column : (data1) 19
     <ddf>   DW_AT_type        : (ref4) <0xc5b>, PyBufferProcs
     <de3>   DW_AT_data_member_location: (data2) 824
  <2><de5>: Abbrev Number: 15 (DW_TAG_member)
-    <de6>   DW_AT_name        : (strp) (offset: 0x1686): ht_name
+    <de6>   DW_AT_name        : (strp) (offset: 0x1609): ht_name
     <dea>   DW_AT_decl_file   : (data1) 10
     <deb>   DW_AT_decl_line   : (data2) 290
